#
# Copyright (C) 2005 - 2020 TIBCO Software Inc. All rights reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

JAM_001_EDIT_PROPERTIES_TITLE=Administrar ajustes de OLAP
JAM_003_PROFILING_ENABLED=Perfilado de rendimiento activado
JAM_004_XMLA_MAX_DRILL_THROUGH=M\u00E1xima obtenci\u00F3n de detalles de XML/A en filas
JAM_005_DISABLE_MEMORY_CACHE=Desactivar cach\u00E9 de memoria OLAP
JAM_006_GENERATE_FORMATTED_SQL=Generar trazas de SQL con formato
JAM_007_TRACE_LEVEL=Nivel de traza (establecer nivel mayor que 0 para consultas SQL)
JAM_008_TRACE_FILE=Archivo de traza -- nulo para salida est\u00E1ndar
JAM_009_QUERY_LIMIT=L\u00EDmite de consultas
JAM_010_RESULT_LIMIT=L\u00EDmite de resultados (n\u00FAmero de filas)
JAM_011_LARGE_DIMENSION_THRESHOLD=Umbral de dimensi\u00F3n grande
JAM_012_SPARSE_DENSITY_THRESHOLD=Umbral de densidad de segmentos dispersos
JAM_013_SPARSE_COUNT_THRESHOLD=Umbral de n\u00FAmero de segmentos dispersos (n\u00FAmero de valores de celda)
JAM_014_ENABLE_AGGREGATES=Activar tablas de agregados
JAM_015_CHOOSE_AGGREGATES_BY_VOL=Elegir tabla de agregados por volumen
JAM_016_VIEW_PROPERTIES_TITLE=Ver propiedades de servidor OLAP
JAM_017_VIEW_PROPERTIES_HEADER=Propiedades de servidor OLAP
JAM_018_ERROR=Error
JAM_019_WHOLE_NUMBER_ERROR=este valor debe ser un n\u00FAmero entero.
JAM_020_RATIO_NUMBER_ERROR=este valor debe estar comprendido entre 0,0 y 1,0.
JAM_021_ERROR_HEADING=Error de OLAP
JAM_022_ANALYSIS_LICENSE_MISSING=Para acceder a esta p\u00E1gina necesita una licencia con privilegios de Jaspersoft OLAP. 
JAM_023_CONTACT_SUPPORT=P\u00F3ngase en contacto con el servicio de asistencia t\u00E9cnica de JasperSoft.

JAM_022_EVALUATE_MAX_EVAL_DEPTH=N\u00FAmero m\u00E1ximo de pases permisible a la hora de evaluar una expresi\u00F3n MDX
JAM_024_CASE_SENSITIVE=Los identificadores MDX distinguen may\u00FAsculas y min\u00FAsculas
JAM_023_COMPARE_SIBLINGS_BY_ORDER_KEY=Los miembros hermanos se ordenan de acuerdo a su expresi\u00F3n ordinal
JAM_025_QUERY_TIMEOUT=Si > 0, tiempo m\u00E1ximo de consulta (n\u00FAmero de segundos)
JAM_024_NON_EMPTY=Siempre se utiliza No vac\u00EDo
JAM_025_IGNORE_INVALID_MEMBERS=Durante la carga del esquema, los miembros no v\u00E1lidos se omiten y se tratan como nulos.
JAM_026_IGNORE_INVALID_MEMBERS_DURING_QUERY=Durante la validaci\u00F3n de la consulta, los miembros no v\u00E1lidos se omiten y se tratan como nulos.
JAM_027_NULL_MEMBER_REPRESENTATION=Define c\u00F3mo se representa un miembro nulo en la salida de resultado
JAM_028_ITERATION_LIMIT=Si > 0, el n\u00FAmero m\u00E1ximo de iteraciones permitidas al evaluar un agregado
JAM_029_OPTIMIZER_SIZE=Si > 0, l\u00EDmite de resultado de la combinaci\u00F3n cruzada m\u00E1s all\u00E1 del cual se aplicar\u00E1 el optimizador (n\u00FAmero de filas)
JAM_032_NEED_DIMENSION_PREFIX=A los elementos de una dimensi\u00F3n (niveles, jerarqu\u00EDas o miembros) se les debe asignar el prefijo de nombre de la dimensi\u00F3n en la consulta MDX.
JAM_033_IGNORE_MEASURE_FOR_NON_JOINING_PREFIX=Si hay dimensiones no relacionadas con una medida en contexto durante una agregaci\u00F3n, la medida se omite en el contexto de evaluaci\u00F3n
JAM_031_NULL_OR_ZERO_DENOMINATOR_PRODUCES_NULL=La divisi\u00F3n entre nulo o cero produce NULO
JAM_030_SOLVE_ORDER_MODE=Resolver comportamiento de evaluaci\u00F3n de orden
JAM_HEADER_GENERAL_BEHAVIOR=Comportamiento general
JAM_014_AGGREGATE_SECTION=Ajustes de agregados
JAM_016_AGGREGATES_OPTIMIZE_PREDICATES=Optimizar predicados
JAM_017_AGGREGATES_RULES=Archivo de regla para identificaci\u00F3n de tabla de agregado
JAM_018_AGGREGATES_RULE_TAG=Valor de la etiqueta de elementos AggRule
JAM_019_AGGREGATES_GENERATE_SQL=Imprimir SQL para registrar la creaci\u00F3n de la tabla de agregados para asistir a MDX con los agregados
JAM_020_AGGREGATES_JDBC_FACTORY_CLASS=Clase de Factory para determinar las tablas y las columnas de un origen de datos
JAM_034_CACHING_SECTION=Configuraci\u00F3n de generaci\u00F3n de cach\u00E9 y SQL
JAM_035_EXP_CACHE_ENABLE=Utilice una cach\u00E9 para los resultados de expresiones evaluadas con frecuencia
JAM_036_ENABLE_CUBE_MEMBER_CACHE=Objetos RolapCubeMember de cach\u00E9
JAM_037_NATIVE_CROSS_JOIN_ENABLE=Algunas instrucciones MDX de Crossjoin NO VAC\u00CDO se procesar\u00E1n en la base de datos
JAM_038_NATIVE_TOP_COUNT_ENABLE=Algunas instrucciones MDX de TopCount se procesar\u00E1n en la base de datos
JAM_039_NATIVE_FILTER_ENABLE=Algunas instrucciones MDX de filtro() se procesar\u00E1n en la base de datos
JAM_040_NATIVE_NON_EMPTY_ENABLE=Algunas instrucciones MDX NO VAC\u00CDO se procesar\u00E1n en la base de datos
JAM_048_NATIVE_UNSUPPORTED_ALERT=Acci\u00F3n de alerta en caso de que la evaluaci\u00F3n nativa de una funci\u00F3n se haya activado, pero no se admita en una determinada consulta.
JAM_041_GROUPING_SETS_ENABLE=Algunas consultas acumuladas se combinar\u00E1n utilizando un grupo mediante conjuntos de agrupaci\u00F3n si el dialecto SQL lo permite
JAM_043_XMLA_SECTION=Ajustes XML/A
JAM_042_XMLA_DRILL_THROUGH_TOTAL_COUNT_ENABLE=La primera fila del resultado de una consulta de obtenci\u00F3n de detalles XML/A se rellenar\u00E1 con el recuento total de filas
JAM_044_MEMORY_MONITOR_SECTION=Ajustes de control de memoria
JAM_045_MEMORY_MONITOR_ENABLE=Utilizar el controlador de memoria de Java para evitar que se acabe la memoria
JAM_046_MEMORY_MONITOR_THRESHOLD=Umbral para limitar la memoria usada (porcentaje de memoria total)
JAM_047_MEMORY_MONITOR_CLASS=Nombre de clase de factory para administrar la memoria

JAM_048_ZERO_OR_GREATER=este valor debe ser cero o un n\u00FAmero mayor
JAM_049_ONE_OR_GREATER=este valor debe ser uno o un n\u00FAmero mayor
JAM_050_ONE_TO_99=este valor debe estar comprendido entre 1 y 99
JAM_051_INVALID_CLASS=Nombre de clase no v\u00E1lido. No existe en el servidor.
JAM_052_EXP_CALC_CLASS=Nombre de clase de ExpCompiler que se va a utilizar

JAM_053_EXPAND_NON_NATIVE=Expandir subexpresiones no nativas de una expresi\u00F3n nativa en MemberLists
JAM_054_MAX_CONSTRAINTS=N\u00FAmero m\u00E1ximo de restricciones en una \u00FAnica cl\u00E1usula SLQ `IN'
JAM_055_HIGH_CARD_CHUNK_SIZE=N\u00FAmero de miembros le\u00EDdos al procesar elementos con dimensiones de alta cardinalidad

JAM_056_UPDATED=Ajustes actualizados
JAM_057_DONE=Listo

JAM_058_MONITOR_EXECUTION_HISTORY_SIZE=El n\u00FAmero de instancias de ejecuci\u00F3n anteriores que Jaspersoft OLAP conserva en el historial
JAM_059_SEGMENT_CACHE=Define la implementaci\u00F3n de SegmentCache que se va a utilizar
JAM_060_MAX_CACHE_THREADS=N\u00FAmero m\u00E1ximo de subprocesos por instancia de Jaspersoft OLAP que se utilizan para realizar operaciones en las cach\u00E9s externas
JAM_061_MAX_SQL_THREAD=N\u00FAmero m\u00E1ximo de subprocesos por instancia de Jaspersoft OLAP que se utilizan para ejecutar consultas SQL al rellenar segmentos
JAM_062_DISABLE_LOCAL_SEGMENT_CACHE=Determina si los datos de los segmentos se almacenar\u00E1n de forma local en la memoria cach\u00E9.
JAM_063_CELL_BATCH_SIZE=Si el valor es superior a 0, el n\u00FAmero de celdas agrupadas por lotes al crear segmentos.
JAM_064_ENABLE_IN_MEMORY_ROLLUP=Si se activa esta opci\u00F3n, los datos de segmentos se agrupan en la memoria.
JAM_065_FILTER_CHILD_LESS_SNOW_FLAKE_MEMBERS=Si se activa esta opci\u00F3n, algunas consultas sobre miembros de alto nivel de dimensiones de copo de nieve son m\u00E1s costosas.
JAM_066_MAX_QUERY_THREADS=N\u00FAmero m\u00E1ximo de subprocesos de consulta MDX por instancia de Jaspersoft OLAP
JAM_067_SHEPHERD_THREAD_POLLING_INTERVAL=Intervalo entre las operaciones de sondeo realizadas por el subproceso gu\u00EDa de RolapConnection
JAM_068_SCHEMA_REFRESH_INTERVAL=Intervalo entre actualizaciones en la lista de cat\u00E1logos XML/A
JAM_069_STATISTICS_PROVIDER=Lista de clases separadas por comas que se utilizan para obtener estad\u00EDsticas sobre el n\u00FAmero de filas de una tabla
JAM_070_ENABLE_DRILL_THROUGH=Si se desactiva esta opci\u00F3n, Jaspersoft OLAP devuelve una excepci\u00F3n cuando los usuarios obtienen detalles.

JAM_071_MAX_FILTER_COUNT=N\u00FAmero m\u00E1ximo de valores de filtro en la vista ad hoc basada en OLAP
JAM_072_READ_AGGREGATE_TABLES=Activar tablas de agregados