ji.export.help.header=Utilisation\u00a0: {0} [OPTIONS]\n\nOptions\u00a0:\n

ji.export.arg.description.help=Imprimer cette page d'aide.

ji.export.arg.description.output-dir=Chemin d'un r\u00e9pertoire dans lequel cr\u00e9er un dossier de catalogue de sortie.
ji.export.arg.description.input-dir=Chemin d'importation d'un catalogue depuis un r\u00e9pertoire.

ji.export.arg.description.output-zip=Chemin et nom de fichier du fichier .zip d'un catalogue de sortie \u00e0 cr\u00e9er \n(omettre le chemin pour placer le fichier .zip dans le r\u00e9pertoire actuel).
ji.export.arg.description.input-zip=Chemin et nom de fichier d'importation d'un catalogue depuis un fichier .zip \n(omettre le chemin si le fichier .zip se trouve dans le r\u00e9pertoire actuel).
ji.export.arg.description.update-core-user=Lorsque cette option est utilis\u00e9e sans l\u2019option de mise \u00e0 jour, les utilisateurs principaux figurant dans le catalogue ne sont pas \nmis \u00e0 jour. Utilisez cette option pour remplacer les utilisateurs principaux actuellement \nd\u00e9finis.
ji.export.arg.description.skip-user-update=Lorsque cette option est utilis\u00e9e avec l'option de mise \u00e0 jour, les utilisateurs figurant dans le catalogue \nne sont pas import\u00e9s. Utilisez cette option pour importer des catalogues sans remplacer \nles utilisateurs actuellement d\u00e9finis.

ji.export.arg.description.update=Les ressources figurant dans le catalogue remplaceront celles contenues dans le r\u00e9f\u00e9rentiel si \nleurs URI et leurs types correspondent.

ji.export.arg.description.everything=Exportez tous les \u00e9l\u00e9ments except\u00e9 des \u00e9v\u00e9nements d'acc\u00e8s : tous les r\u00f4les, utilisateurs, \nt\u00e2ches de rapport, autorisations et ressources du r\u00e9f\u00e9rentiel.

ji.export.arg.description.uris=URI du r\u00e9f\u00e9rentiel pour les ressources ou dossiers \u00e0 exporter.
ji.export.arg.description.repository-permissions=Lorsque cette option est utilis\u00e9e avec l'option d'URI, les autorisations du r\u00e9f\u00e9rentiel \nsont export\u00e9es avec chaque dossier et ressource.
 
ji.export.arg.description.roles=Liste s\u00e9par\u00e9e par des virgules des r\u00f4les \u00e0 exporter ; si aucun r\u00f4le n'est sp\u00e9cifi\u00e9 \navec cette option, tous les r\u00f4les sont export\u00e9s.
ji.export.arg.description.users=Liste s\u00e9par\u00e9e par des virgules des utilisateurs \u00e0 exporter ; si aucun utilisateur n'est sp\u00e9cifi\u00e9 \navec cette option, tous les utilisateurs sont export\u00e9s.
ji.export.arg.description.role-users=Lorsque cette option est utilis\u00e9e avec l'option de r\u00f4le, les utilisateurs appartenant \u00e0 chaque r\u00f4le sont export\u00e9s.

ji.export.arg.description.report-jobs=Liste s\u00e9par\u00e9e par des virgules des URI de dossier et d'unit\u00e9 de rapport du r\u00e9f\u00e9rentiel \npour lesquels les t\u00e2ches d'unit\u00e9 de rapport doivent \u00eatre export\u00e9es.

ji.export.arg.description.prepend-path=Cha\u00eene \u00e0 ajouter avant un chemin URI pour toutes les ressources import\u00e9es.

ji.export.arg.description.pass=Mot de passe \u00e0 coder.

ji.export.encryption.enc-pass=\n\nCryptage du mot de passe\u00a0:{0}\n
ji.export.encryption.add-string=Ajouter la cha\u00eene suivante \u00e0 js.jdbc.properties\u00a0:

ji.export.arg.description.include-access-events=Prise en compte de l'importation/exportation des \u00e9v\u00e9nements d'acc\u00e8s.

ji.export.arg.description.include-audit-events=Prise en compte de l'importation/exportation des donn\u00e9es d'audit.

ji.export.arg.description.include-monitoring-events=Prise en compte de l'importation/exportation des donn\u00e9es d'audit.

ji.export.arg.description.include-server-settings=Param\u00e8tres du serveur inclus.

ji.export.organization.unsupported.operation=La ressource avec l'URI de r\u00e9f\u00e9rentiel {0} est une organisation.\nJasperReports Server ne prend pas en charge l'exportation des organisations.
