ji.export.help.header=Uso: {0} [OPCIONES]\n\nOpciones:\n

ji.export.arg.description.help=Imprimir esta ayuda.

ji.export.arg.description.output-dir=Ruta del directorio en el que se crear\u00e1 la carpeta de cat\u00e1logo de salida.
ji.export.arg.description.input-dir=Ruta para importar un cat\u00e1logo desde un directorio.

ji.export.arg.description.output-zip=Ruta y nombre de archivo del archivo zip de salida que se crear\u00e1 (omitir ruta para colocar el zip en el directorio actual).
ji.export.arg.description.input-zip=Ruta y nombre de archivo para importar un cat\u00e1logo desde un archivo zip (omitir ruta si el zip se encuentra en el directorio actual).
ji.export.arg.description.update-core-user=Cuando se utiliza sin la opci\u00f3n --update, los usuarios centrales del cat\u00e1logo no\nse actualizar\u00e1n. Use esta opci\u00f3n para sobrescribir los usuarios\ncentrales definidos actualmente.
ji.export.arg.description.skip-user-update=Cuando se utiliza con la --opci\u00f3n de actualizaci\u00f3n, no se importar\u00e1n los usuarios del cat\u00e1logo. Utilice esta opci\u00f3n para importar cat\u00e1logos sin sobrescribir los usuarios definidos actualmente.

ji.export.arg.description.update=Los recursos del cat\u00e1logo sustituir\u00e1n a los del repositorio si coinciden sus URI y tipos.

ji.export.arg.description.everything=Exportar todo, excepto los eventos de acceso: todos los recursos del repositorio, permisos, trabajos de informes, usuarios y funciones.

ji.export.arg.description.uris=URI de repositorio de recursos o carpetas para exportar.
ji.export.arg.description.repository-permissions=Cuando se utiliza con la opci\u00f3n --uris, los permisos de repositorio se exportar\u00e1n junto a cada carpeta y recurso.
 
ji.export.arg.description.roles=Lista de funciones separada por comas para exportar; si no se especifican funciones,\ncon esta opci\u00f3n se exportar\u00e1n todas las funciones.
ji.export.arg.description.users=Lista de usuarios separada por comas para exportar; si no se especifican usuarios,\ncon esta opci\u00f3n se exportar\u00e1n todas los usuarios.
ji.export.arg.description.role-users=Cuando se utiliza con la --opci\u00f3n de funciones, se exportar\u00e1n los usuarios pertenecientes a cada funci\u00f3n.

ji.export.arg.description.report-jobs=Lista de URI de carpetas y unidades de informe de repositorio separados por comas\npara los que deben exportarse los trabajos de unidad de informe.

ji.export.arg.description.prepend-path=Cadena para anexar a una ruta de URI para todos los recursos importados.

ji.export.arg.description.pass=Contrase\u00f1a para codificar.

ji.export.encryption.enc-pass=\n\nContrase\u00f1a de cifrado:{0}\n
ji.export.encryption.add-string=Agregar siguiente cadena a js.jdbc.properties:

ji.export.arg.description.include-access-events=Incluyendo eventos de acceso de importaci\u00f3n/exportaci\u00f3n.

ji.export.arg.description.include-audit-events=Incluyendo datos de auditor\u00eda de importaci\u00f3n/exportaci\u00f3n.

ji.export.arg.description.include-monitoring-events=Incluyendo datos de auditor\u00eda de importaci\u00f3n/exportaci\u00f3n.

ji.export.arg.description.include-server-settings=Incluyendo configuraci\u00f3n del servidor.

ji.export.organization.unsupported.operation=El recurso con la URI de repositorio {0} es una organizaci\u00f3n.\nJasperReports Server no admite la exportaci\u00f3n de organizaciones individuales.
