ji.export.help.header=\u4f7f\u7528\u65b9\u6cd5:{0} [OPTIONS]\n\n\u30aa\u30d7\u30b7\u30e7\u30f3:\n

ji.export.arg.description.help=\u3053\u306e\u30d8\u30eb\u30d7\u3092\u5370\u5237\u3057\u307e\u3059\u3002

ji.export.arg.description.output-dir=\u51fa\u529b\u30ab\u30bf\u30ed\u30b0 \u30d5\u30a9\u30eb\u30c0\u3092\u4f5c\u6210\u3059\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3078\u306e\u30d1\u30b9\u3002
ji.export.arg.description.input-dir=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30ab\u30bf\u30ed\u30b0\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u305f\u3081\u306e\u30d1\u30b9\u3002

ji.export.arg.description.output-zip=\u4f5c\u6210\u3059\u308b\u51fa\u529b\u30ab\u30bf\u30ed\u30b0 zip \u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u3068\u30d5\u30a1\u30a4\u30eb\u540d \n(\u73fe\u5728\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b zip \u3092\u914d\u7f6e\u3059\u308b\u5834\u5408\u306f\u30d1\u30b9\u3092\u7701\u7565)\u3002
ji.export.arg.description.input-zip=zip \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30ab\u30bf\u30ed\u30b0\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u305f\u3081\u306e\u30d1\u30b9\u3068\u30d5\u30a1\u30a4\u30eb\u540d \n(zip \u304c\u73fe\u5728\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3042\u308b\u5834\u5408\u306f\u30d1\u30b9\u3092\u7701\u7565)\u3002
ji.export.arg.description.update-core-user=--update \u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u6307\u5b9a\u305b\u305a\u306b\u4f7f\u7528\u3059\u308b\u3068\u3001\u30ab\u30bf\u30ed\u30b0\u5185\u306e\u30b3\u30a2 \u30e6\u30fc\u30b6\u30fc\u306f \n\u66f4\u65b0\u3055\u308c\u307e\u305b\u3093\u3002\u73fe\u5728\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30b3\u30a2 \u30e6\u30fc\u30b6\u30fc\u3092\u4e0a\u66f8\u304d\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ji.export.arg.description.skip-user-update=--update \u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u30ab\u30bf\u30ed\u30b0\u5185\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u30a4\u30f3\u30dd\u30fc\u30c8 \n\u3055\u308c\u307e\u305b\u3093\u3002\u73fe\u5728\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30e6\u30fc\u30b6\u30fc\u3092\u4e0a\u66f8\u304d\u305b\u305a\u306b\u30ab\u30bf\u30ed\u30b0\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u5834\u5408\u306b\u3001 \n\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ji.export.arg.description.update=\u30ab\u30bf\u30ed\u30b0\u5185\u306e\u30ea\u30bd\u30fc\u30b9\u304c\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u30ea\u30bd\u30fc\u30b9\u3068 URI \u3068\u30bf\u30a4\u30d7\u304c\u4e00\u81f4\u3059\u308b\u5834\u5408\u3001 \n\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u30ea\u30bd\u30fc\u30b9\u304c\u30ab\u30bf\u30ed\u30b0\u306e\u30ea\u30bd\u30fc\u30b9\u3067\u7f6e\u63db\u3055\u308c\u307e\u3059\u3002

ji.export.arg.description.everything=\u30a2\u30af\u30bb\u30b9 \u30a4\u30d9\u30f3\u30c8\u4ee5\u5916\u306e\u3059\u3079\u3066\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u307e\u3059:\u3059\u3079\u3066\u306e\u30ea\u30dd\u30b8\u30c8\u30ea \u30ea\u30bd\u30fc\u30b9\u3001\u6a29\u9650\u3001 \u30ec\u30dd\u30fc\u30c8 \u30b8\u30e7\u30d6\u3001\u30e6\u30fc\u30b6\u30fc\u3001\u304a\u3088\u3073\u30ed\u30fc\u30eb\u3002

ji.export.arg.description.uris=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u30ea\u30bd\u30fc\u30b9\u307e\u305f\u306f\u30d5\u30a9\u30eb\u30c0\u306e\u30ea\u30dd\u30b8\u30c8\u30ea URI\u3002
ji.export.arg.description.repository-permissions=--uris \u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u5404\u30d5\u30a9\u30eb\u30c0\u3084\u30ea\u30bd\u30fc\u30b9\u3068\u3068\u3082\u306b \n\u30ea\u30dd\u30b8\u30c8\u30ea\u6a29\u9650\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002
 
ji.export.arg.description.roles=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u30ed\u30fc\u30eb\u306e\u30ab\u30f3\u30de\u533a\u5207\u308a\u30ea\u30b9\u30c8\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u30ed\u30fc\u30eb\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u3001 \u3059\u3079\u3066\u306e\u30ed\u30fc\u30eb\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002
ji.export.arg.description.users=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u30ab\u30f3\u30de\u533a\u5207\u308a\u30ea\u30b9\u30c8\u3002\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u30e6\u30fc\u30b6\u30fc\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u3001 \u3059\u3079\u3066\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002
ji.export.arg.description.role-users=--roles \u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u3068\u3001\u5404\u30ed\u30fc\u30eb\u306b\u6240\u5c5e\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002

ji.export.arg.description.report-jobs=\u30ec\u30dd\u30fc\u30c8 \u30e6\u30cb\u30c3\u30c8 \u30b8\u30e7\u30d6\u304c\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u3001\u30ea\u30dd\u30b8\u30c8\u30ea \u30ec\u30dd\u30fc\u30c8 \u30e6\u30cb\u30c3\u30c8\u3068\u30d5\u30a9\u30eb\u30c0 URI \u306e\u30ab\u30f3\u30de\u533a\u5207\u308a\u30ea\u30b9\u30c8\u3002

ji.export.arg.description.prepend-path=\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u305f\u3059\u3079\u3066\u306e\u30ea\u30bd\u30fc\u30b9\u306e URI \u30d1\u30b9\u306e\u5148\u982d\u306b\u8ffd\u52a0\u3059\u308b\u6587\u5b57\u5217\u3002

ji.export.arg.description.pass=\u30a8\u30f3\u30b3\u30fc\u30c9\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3002

ji.export.encryption.enc-pass=\n\n\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6697\u53f7\u5316\u3057\u3066\u3044\u307e\u3059:{0}\n
ji.export.encryption.add-string=js.jdbc.properties \u306b\u6b21\u306e\u6587\u5b57\u5217\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044:

ji.export.arg.description.include-access-events=\u30a2\u30af\u30bb\u30b9\u30a4\u30d9\u30f3\u30c8\u306e\u30a4\u30f3\u30dd\u30fc\u30c8\uff0f\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3092\u542b\u307f\u307e\u3059\u3002

ji.export.arg.description.include-audit-events=\u76e3\u67fb\u30c7\u30fc\u30bf\u306e\u30a4\u30f3\u30dd\u30fc\u30c8\uff0f\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3092\u542b\u307f\u307e\u3059.

ji.export.arg.description.include-monitoring-events=\u76e3\u67fb\u30c7\u30fc\u30bf\u306e\u30a4\u30f3\u30dd\u30fc\u30c8\uff0f\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3092\u542b\u307f\u307e\u3059.

ji.export.arg.description.include-server-settings=\u30b5\u30fc\u30d0\u30fc\u8a2d\u5b9a\u3092\u542b\u307f\u307e\u3059\u3002

ji.export.organization.unsupported.operation=\u30ea\u30dd\u30b8\u30c8\u30ea URI {0} \u306e\u30ea\u30bd\u30fc\u30b9\u306f\u7d44\u7e54\u3067\u3059\u3002\nJasperReports Server \u306f\u3001\u500b\u5225\u306e\u7d44\u7e54\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
