ji.export.help.header=Uso: {0} [OPTIONS]\n\nOp\u00e7\u00f5es:\n

ji.export.arg.description.help=Imprimir essa ajuda.

ji.export.arg.description.output-dir=Caminho para um diret\u00f3rio no qual a pasta de cat\u00e1logo de sa\u00edda ser\u00e1 criada.
ji.export.arg.description.input-dir=Caminho para a importa\u00e7\u00e3o de um cat\u00e1logo a partir de um diret\u00f3rio.

ji.export.arg.description.output-zip=Caminho e nome do arquivo zip de cat\u00e1logo de sa\u00edda a ser criado\n(omitir caminho para colocar zip no diret\u00f3rio atual)
ji.export.arg.description.input-zip=Caminho e nome do arquivo para importa\u00e7\u00e3o de um cat\u00e1logo a partir de um arquivo zip\n(omitir caminho se zip estiver no diret\u00f3rio atual).
ji.export.arg.description.update-core-user=Quando utilizado sem a op\u00e7\u00e3o --atualizar, os usu\u00e1rios do n\u00facleo do cat\u00e1logo n\u00e3o ser\u00e3o \natualizados. Use esta op\u00e7\u00e3o para substituir usu\u00e1rios do n\u00facleo\n atualmente definidos.
ji.export.arg.description.skip-user-update=Quando utilizado com a op\u00e7\u00e3o --atualizar, os usu\u00e1rios do cat\u00e1logo n\u00e3o ser\u00e3o\nimportados. Use esta op\u00e7\u00e3o para importar cat\u00e1logos sem substituir\nusu\u00e1rios atualmente definidos.

ji.export.arg.description.update=Recursos no cat\u00e1logo substituir\u00e3o os do reposit\u00f3rio se\nURIs e tipos de corresponderem.

ji.export.arg.description.everything=Exportar tudo, exceto eventos de acesso: todos os recursos do reposit\u00f3rio,\npermiss\u00f5es, trabalhos de relat\u00f3rio, usu\u00e1rios e fun\u00e7\u00f5es.

ji.export.arg.description.uris=URIs do reposit\u00f3rio de recursos ou pastas a serem exportados.
ji.export.arg.description.repository-permissions=Quando utilizado com a op\u00e7\u00e3o --uris, permiss\u00f5es do reposit\u00f3rio ser\u00e3o\nexportadas junto com cada pasta e recurso.
 
ji.export.arg.description.roles=Lista de fun\u00e7\u00f5es a serem exportadas separadas por v\u00edrgula; se nenhuma fun\u00e7\u00e3o for especificada com esta op\u00e7\u00e3o, todas as fun\u00e7\u00f5es ser\u00e3o exportadas.
ji.export.arg.description.users=Lista de usu\u00e1rios a serem exportados, separados por v\u00edrgula; se nenhum usu\u00e1rio estiver\nespecificado com esta op\u00e7\u00e3o, todos os usu\u00e1rios ser\u00e3o exportados.
ji.export.arg.description.role-users=Quando utilizado com a op\u00e7\u00e3o --fun\u00e7\u00f5es, os usu\u00e1rios pertencentes a cada fun\u00e7\u00e3o ser\u00e3o exportados.

ji.export.arg.description.report-jobs=Lista separada por v\u00edrgula de unidade de relat\u00f3rio de reposit\u00f3rio e URIs da pasta \npara quais os trabalhos da unidade de relat\u00f3rio devem ser exportados.

ji.export.arg.description.prepend-path=String a ser prefixada a um caminho URI para todos os recursos importados.

ji.export.arg.description.pass=Senha a ser codificada.

ji.export.encryption.enc-pass=\n\nCriptografando senha:{0}\n
ji.export.encryption.add-string=Adicionar nova string para js.jdbc.properties:

ji.export.arg.description.include-access-events=Incluindo importa\u00e7\u00e3o/exporta\u00e7\u00e3o de eventos de acesso.

ji.export.arg.description.include-audit-events=Incluindo importa\u00e7\u00e3o/exporta\u00e7\u00e3o de dados de auditoria.

ji.export.arg.description.include-monitoring-events=Incluindo importa\u00e7\u00e3o/exporta\u00e7\u00e3o de dados de monitoramento.

ji.export.arg.description.include-server-settings=Incluindo configura\u00e7\u00f5es do servidor.

ji.export.organization.unsupported.operation=O recurso com URI de reposit\u00f3rio {0} \u00e9 uma organiza\u00e7\u00e3o.\nJasperReports Server n\u00e3o suporta exporta\u00e7\u00e3o de organiza\u00e7\u00f5es individuais.
