#
# Copyright (C) 2005-2023. Cloud Software Group, Inc. All Rights Reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

ji.export.help.header=Verwendung: {0} [OPTIONEN]\n\nOptionen:\n

ji.export.arg.description.help=Dieses Hilfethema ausgeben.

ji.export.arg.description.output-dir=Pfad zum Verzeichnis, in dem der Ausgabekatalogordner erstellt werden soll.
ji.export.arg.description.input-dir=Pfad f\u00FCr den Import eines Katalogs aus einem Verzeichnis.

ji.export.arg.description.output-zip=Pfad und Dateiname der zu erstellenden ZIP-Datei des Ausgabekatalogs\n(ohne Pfadangabe wird die ZIP-Datei im aktuellen Verzeichnis abgelegt)
ji.export.arg.description.input-zip=Pfad und Dateiname f\u00FCr den Import eines Katalogs aus einer ZIP-Datei\n(Pfadangabe kann unterbleiben, wenn sich die ZIP-Datei im aktuellen Verzeichnis befindet)
ji.export.arg.description.update-core-user=Bei der Verwendung ohne die Option '--update' werden Kernbenutzer im Katalog nicht \naktualisiert. Verwenden Sie diese Option, um die aktuell festgelegten Kernbenutzer \n zu \u00FCberschreiben.
ji.export.arg.description.skip-user-update=Bei Verwendung mit der Option '--update' werden Benutzer im Katalog\nnicht importiert. Verwenden Sie diese Option zum Importieren von Katalogen,\nohne derzeit definierte Benutzer zu \u00FCberschreiben.

ji.export.arg.description.update=Bei \u00FCbereinstimmenden URIs und Typen werden die Ressourcen\nim Repository durch die Ressourcen aus dem Katalog ersetzt.

ji.export.arg.description.everything=Alles au\u00DFer Zugriffsereignissen exportieren: Alle Repository-Ressourcen,\nBerechtigungen, Berichtsauftr\u00E4ge, Benutzer und Rollen.

ji.export.arg.description.uris=Repository-URIs f\u00FCr zu exportierende Ressourcen oder Ordner.
ji.export.arg.description.repository-permissions=Bei Verwendung der Option '--uris' werden alle Repository-Berechtigungen\nzusammen mit den einzelnen Ordnern und Ressourcen exportiert.
 
ji.export.arg.description.roles=Durch Kommas getrennte Liste der zu exportierenden Rollen; wenn mit\ndieser Option keine Rollen angegeben werden, werden alle Rollen exportiert.
ji.export.arg.description.users=Durch Kommas getrennte Liste der zu exportierenden Benutzer; wenn mit\ndieser Option keine Benutzer angegeben werden, werden alle Benutzer exportiert.
ji.export.arg.description.role-users=Bei Verwendung mit der Option '--roles' werden die Benutzer exportiert, die zu den einzelnen Rollen geh\u00F6ren.
ji.export.arg.description.users-roles=Bei Verwendung mit der Option '--users' werden die Rollen exportiert, die zu den einzelnen Benutzern geh\u00F6ren.

ji.export.arg.description.report-jobs=Durch Kommas getrennte Listen von Berichtseinheiten oder Ordner-URIs, \nf\u00FCr die geplante Auftr\u00E4ge exportiert werden sollten.

ji.export.arg.description.prepend-path=Zeichenfolge, die dem URI-Pfad f\u00FCr alle importierten Ressourcen vorangestellt werden soll.

ji.export.arg.description.pass=Zu codierendes Passwort.

ji.export.encryption.enc-pass=\n\nPasswort f\u00FCr Verschl\u00FCsselung:{0}\n
ji.export.encryption.add-string=F\u00FCgen Sie der Datei "js.jdbc.properties" die folgenden Zeichenfolgen hinzu:

ji.export.arg.description.include-access-events=Beim Importieren oder Exportieren werden Zugriffsereignisse eingeschlossen.

ji.export.arg.description.include-audit-events=Beim Importieren oder Exportieren werden Pr\u00FCfdaten eingeschlossen.

ji.export.arg.description.include-monitoring-events=Beim Importieren oder Exportieren werden \u00DCberwachungsdaten eingeschlossen.

ji.export.arg.description.include-server-settings=Servereinstellungen werden eingeschlossen.
ji.export.arg.description.include-attributes=Attribute werden eingeschlossen.
ji.export.arg.description.skip-attribute-values=Attributwerte werden \u00FCbersprungen.
ji.export.arg.description.resource-types=Durch Kommas getrennte Liste von zu exportierenden Ressourcentypen. Alle verf\u00FCgbaren Ressourcentypen: {0}.
ji.export.arg.description.skip-dependent-resources=Abh\u00E4ngige Ressourcen werden \u00FCbersprungen.
ji.export.broken-dependencies=Die folgenden Ressourcen weisen Abh\u00E4ngigkeitsfehler auf. Sie verweisen auf Ressourcen, die nicht verf\u00FCgbar sind.

ji.export.arg.description.broken-dependencies=Legt die Aktion fest, die bei Abh\u00E4ngigkeitsfehlern durchgef\u00FChrt wird: "fail", "skip" oder "include". Der Standardwert lautet "fail".\n fail: Der Server bricht den Import ab und gibt einen Fehler aus.\n skip: Der Import wird fortgesetzt, Ressourcen mit Abh\u00E4ngigkeitsfehlern werden jedoch nicht importiert.\n include: Der Import wird fortgesetzt, und Ressourcen mit Abh\u00E4ngigkeitsfehlern werden importiert.

import.broken.dependencies=Die Importdatei enth\u00E4lt Ressourcen mit Abh\u00E4ngigkeitsfehlern.
import.broken.dependencies.options=Geben Sie "a" zum ABBRECHEN des Imports, "\u00FC" zum Fortsetzen des Imports und \u00DCBERSPRINGEN von Ressourcen mit Abh\u00E4ngigkeitsfehlern oder "e" zum Fortsetzen des Imports und EINSCHLIESSEN von Ressourcen mit Abh\u00E4ngigkeitsfehlern ein. Der Standardwert lautet "a".

ji.export.organization.unsupported.operation=Die Ressource mit der Repository-URI {0} ist eine Organisation.\nDas Exportieren einzelner Organisationen wird von JasperReports Server nicht unterst\u00FCtzt.

ji.export.arg.description.input-key=um den geheimen Schl\u00FCssel der Import-Export-Chiffre anzugeben
ji.export.arg.description.keyalias=um den Alias des Schl\u00FCssels im Keystore anzugeben
ji.export.arg.description.keypass=um das Passwort f\u00FCr den Zugriff auf den Schl\u00FCssel im Keystore anzugeben
ji.export.arg.description.keyalg=um den Verschl\u00FCsselungsalgorithmus anzugeben
ji.export.arg.description.keysize=um die Schl\u00FCsselgr\u00F6\u00DFe anzugeben
ji.export.arg.description.keystore=um den Schl\u00FCssel aus einem Java-Keystore zu importieren
ji.export.arg.description.secret-key=um die geheimen Schl\u00FCsselbytes in hex anzugeben.
ji.export.arg.description.storepass=um ein Passwort f\u00FCr den Keystore anzugeben
ji.export.arg.description.genkey=um zuf\u00E4llig den neuen Schl\u00FCssel zu generieren, um die Daten zu verschl\u00FCsseln
ji.export.arg.description.secretUri=um den Speicherort der geheimen Datei anzugeben
ji.export.arg.description.destkeystore=um den Ziel-Keystore f\u00FCr den Export anzugeben
ji.export.arg.description.deststorepass=um das Kennwort f\u00FCr den Zielspeicher f\u00FCr den Export anzugeben
ji.export.arg.description.destkeypass=um das Zielschl\u00FCsselpasswort f\u00FCr den Eingabeschl\u00FCsselalias anzugeben
ji.export.arg.description.visible=um die Sichtbarkeit des Schl\u00FCssels auf der Benutzeroberfl\u00E4che festzulegen
ji.export.arg.description.keylabel=um die Bezeichnung des Schl\u00FCssels anzugeben, der von der Benutzeroberfl\u00E4che verwendet werden soll
ji.export.arg.description.keyorganisation=um die Organisations-ID anzugeben, zu der dieser Schl\u00FCssel geh\u00F6rt
ji.export.arg.description.calendars=um Kalender aller in der Zeitplanung definierten Typen (Feiertag, wiederkehrend ...) anzugeben
ji.export.arg.description.skip-favorite-resources=Bevorzugte Ressourcen \u00FCberspringen.