#
# Copyright (C) 2005-2023. Cloud Software Group, Inc. All Rights Reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

ji.export.help.header=Utilisation\u00A0: {0} [OPTIONS]\n\nOptions\u00A0:\n

ji.export.arg.description.help=Imprimer cette page d'aide.

ji.export.arg.description.output-dir=Chemin d'un r\u00E9pertoire dans lequel cr\u00E9er un dossier de catalogue de sortie.
ji.export.arg.description.input-dir=Chemin d'importation d'un catalogue depuis un r\u00E9pertoire.

ji.export.arg.description.output-zip=Chemin et nom de fichier du fichier .zip d'un catalogue de sortie \u00E0 cr\u00E9er \n(omettre le chemin pour placer le fichier .zip dans le r\u00E9pertoire actuel).
ji.export.arg.description.input-zip=Chemin et nom de fichier d'importation d'un catalogue depuis un fichier .zip \n(omettre le chemin si le fichier .zip se trouve dans le r\u00E9pertoire actuel).
ji.export.arg.description.update-core-user=Lorsque cette option est utilis\u00E9e sans l\u2019option de mise \u00E0 jour, les utilisateurs principaux figurant dans le catalogue ne sont pas \nmis \u00E0 jour. Utilisez cette option pour remplacer les utilisateurs principaux actuellement \nd\u00E9finis.
ji.export.arg.description.skip-user-update=Lorsque cette option est utilis\u00E9e avec l'option de mise \u00E0 jour, les utilisateurs figurant dans le catalogue \nne sont pas import\u00E9s. Utilisez cette option pour importer des catalogues sans remplacer \nles utilisateurs actuellement d\u00E9finis.

ji.export.arg.description.update=Les ressources figurant dans le catalogue remplaceront celles contenues dans le r\u00E9f\u00E9rentiel si \nleurs URI et leurs types correspondent.

ji.export.arg.description.everything=Exportez tous les \u00E9l\u00E9ments except\u00E9 des \u00E9v\u00E9nements d'acc\u00E8s : tous les r\u00F4les, utilisateurs, \nt\u00E2ches de rapport, autorisations et ressources du r\u00E9f\u00E9rentiel.

ji.export.arg.description.uris=URI du r\u00E9f\u00E9rentiel pour les ressources ou dossiers \u00E0 exporter.
ji.export.arg.description.repository-permissions=Lorsque cette option est utilis\u00E9e avec l'option d'URI, les autorisations du r\u00E9f\u00E9rentiel \nsont export\u00E9es avec chaque dossier et ressource.
 
ji.export.arg.description.roles=Liste s\u00E9par\u00E9e par des virgules des r\u00F4les \u00E0 exporter ; si aucun r\u00F4le n'est sp\u00E9cifi\u00E9 \navec cette option, tous les r\u00F4les sont export\u00E9s.
ji.export.arg.description.users=Liste s\u00E9par\u00E9e par des virgules des utilisateurs \u00E0 exporter ; si aucun utilisateur n'est sp\u00E9cifi\u00E9 \navec cette option, tous les utilisateurs sont export\u00E9s.
ji.export.arg.description.role-users=Lorsque cette option est utilis\u00E9e avec l'option de r\u00F4le, les utilisateurs appartenant \u00E0 chaque r\u00F4le sont export\u00E9s.
ji.export.arg.description.users-roles=Lorsque cette option est utilis\u00E9e avec l'option Utilisateurs, les r\u00F4les appartenant \u00E0 chaque utilisateur sont export\u00E9s.

ji.export.arg.description.report-jobs=Liste s\u00E9par\u00E9e par des virgules des unit\u00E9s de rapport ou des URI de dossier \npour lesquels les travaux planifi\u00E9s doivent \u00EAtre export\u00E9s.

ji.export.arg.description.prepend-path=Cha\u00EEne \u00E0 ajouter avant un chemin URI pour toutes les ressources import\u00E9es.

ji.export.arg.description.pass=Mot de passe \u00E0 coder.

ji.export.encryption.enc-pass=\n\nCryptage du mot de passe\u00A0:{0}\n
ji.export.encryption.add-string=Ajouter la cha\u00EEne suivante \u00E0 js.jdbc.properties :

ji.export.arg.description.include-access-events=Inclure les \u00E9v\u00E9nements d'acc\u00E8s lors de l'importation ou de l'exportation.

ji.export.arg.description.include-audit-events=Inclure les donn\u00E9es d'audit lors de l'importation ou de l'exportation.

ji.export.arg.description.include-monitoring-events=Inclure les donn\u00E9es de surveillance lors de l'importation ou de l'exportation.

ji.export.arg.description.include-server-settings=Inclure les param\u00E8tres du serveur.
ji.export.arg.description.include-attributes=Inclure les attributs.
ji.export.arg.description.skip-attribute-values=Ignorer les valeurs d'attribut.
ji.export.arg.description.resource-types=Liste s\u00E9par\u00E9e par des virgules des types de ressources \u00E0 exporter. Tous les types de ressources disponibles : {0}.
ji.export.arg.description.skip-dependent-resources=Ignorer les ressources d\u00E9pendantes.
ji.export.broken-dependencies=Les ressources suivantes ont des d\u00E9pendances rompues. Elles font r\u00E9f\u00E9rence \u00E0 d'autres ressources non accessibles.

ji.export.arg.description.broken-dependencies=D\u00E9finit l'action \u00E0 effectuer en cas de d\u00E9pendances rompues : \u00C9chec, Ignorer ou Inclure. La valeur par d\u00E9faut est \u00C9chec.\n \u00C9chec : le serveur annule l'importation et renvoie une erreur.\n Ignorer : l'importation a lieu, mais les ressources ayant des d\u00E9pendances rompues ne sont pas import\u00E9es.\n Inclure : l'importation a lieu et les ressources ayant des d\u00E9pendances rompues sont import\u00E9es.

import.broken.dependencies=Le fichier d'importation contient des ressources ayant des d\u00E9pendances rompues.
import.broken.dependencies.options=Saisissez 'c' pour ANNULER l'importation, 's' pour continuer l'importation mais IGNORER les ressources ayant des d\u00E9pendances rompues ou 'i' pour continuer l'importation et INCLURE les ressources ayant des d\u00E9pendances rompues. La valeur par d\u00E9faut est 'c'.

ji.export.organization.unsupported.operation=La ressource avec l'URI de r\u00E9f\u00E9rentiel {0} est une organisation.\nJasperReports Server ne prend pas en charge l'exportation des organisations.

ji.export.arg.description.input-key=pour sp\u00E9cifier la cl\u00E9 secr\u00E8te du chiffrement import-export
ji.export.arg.description.keyalias=pour sp\u00E9cifier l'alias de la cl\u00E9 dans le magasin de cl\u00E9s
ji.export.arg.description.keypass=pour sp\u00E9cifier le mot de passe pour acc\u00E9der \u00E0 la cl\u00E9 dans le magasin de cl\u00E9s
ji.export.arg.description.keyalg=pour sp\u00E9cifier l'algorithme de chiffrement
ji.export.arg.description.keysize=pour sp\u00E9cifier la taille de la cl\u00E9
ji.export.arg.description.keystore=pour importer la cl\u00E9 \u00E0 partir d'un magasin de cl\u00E9s Java
ji.export.arg.description.secret-key=pour sp\u00E9cifier les octets de la cl\u00E9 secr\u00E8te en hexad\u00E9cimal
ji.export.arg.description.storepass=pour sp\u00E9cifier un mot de passe pour le magasin de cl\u00E9s
ji.export.arg.description.genkey=pour g\u00E9n\u00E9rer de mani\u00E8re al\u00E9atoire la nouvelle cl\u00E9 pour chiffrer les donn\u00E9es
ji.export.arg.description.secretUri=pour sp\u00E9cifier l'emplacement du r\u00E9f\u00E9rentiel de fichiers secrets
ji.export.arg.description.destkeystore=pour sp\u00E9cifier le magasin de cl\u00E9s de destination pour l'exportation
ji.export.arg.description.deststorepass=pour sp\u00E9cifier le mot de passe du magasin de destination pour l'exportation
ji.export.arg.description.destkeypass=pour sp\u00E9cifier le mot de passe de la cl\u00E9 de destination pour l'alias de cl\u00E9 d'entr\u00E9e
ji.export.arg.description.visible=pour sp\u00E9cifier la visibilit\u00E9 de la cl\u00E9 sur l'interface utilisateur
ji.export.arg.description.keylabel=pour sp\u00E9cifier le libell\u00E9 de la cl\u00E9 que l'interface utilisateur doit utiliser
ji.export.arg.description.keyorganisation=pour sp\u00E9cifier l'ID de l'organisation \u00E0 laquelle cette cl\u00E9 appartient
ji.export.arg.description.calendars=pour sp\u00E9cifier des calendriers de tous les types(vacances, r\u00E9currents\u2026) d\u00E9finis dans le planificateur
ji.export.arg.description.skip-favorite-resources=Ignorer les ressources favorites.