#
# Copyright (C) 2005 - 2020 TIBCO Software Inc. All rights reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

ji.export.help.header=\u4F7F\u7528\u65B9\u6CD5:{0} [OPTIONS]\n\n\u30AA\u30D7\u30B7\u30E7\u30F3:\n

ji.export.arg.description.help=\u3053\u306E\u30D8\u30EB\u30D7\u3092\u5370\u5237\u3057\u307E\u3059\u3002

ji.export.arg.description.output-dir=\u51FA\u529B\u30AB\u30BF\u30ED\u30B0 \u30D5\u30A9\u30EB\u30C0\u3092\u4F5C\u6210\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3078\u306E\u30D1\u30B9\u3002
ji.export.arg.description.input-dir=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304B\u3089\u30AB\u30BF\u30ED\u30B0\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u305F\u3081\u306E\u30D1\u30B9\u3002

ji.export.arg.description.output-zip=\u4F5C\u6210\u3059\u308B\u51FA\u529B\u30AB\u30BF\u30ED\u30B0 zip \u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9\u3068\u30D5\u30A1\u30A4\u30EB\u540D \n(\u73FE\u5728\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B zip \u3092\u914D\u7F6E\u3059\u308B\u5834\u5408\u306F\u30D1\u30B9\u3092\u7701\u7565)\u3002
ji.export.arg.description.input-zip=zip \u30D5\u30A1\u30A4\u30EB\u304B\u3089\u30AB\u30BF\u30ED\u30B0\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u305F\u3081\u306E\u30D1\u30B9\u3068\u30D5\u30A1\u30A4\u30EB\u540D \n(zip \u304C\u73FE\u5728\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u3042\u308B\u5834\u5408\u306F\u30D1\u30B9\u3092\u7701\u7565)\u3002
ji.export.arg.description.update-core-user=--update \u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u6307\u5B9A\u305B\u305A\u306B\u4F7F\u7528\u3059\u308B\u3068\u3001\u30AB\u30BF\u30ED\u30B0\u5185\u306E\u30B3\u30A2 \u30E6\u30FC\u30B6\u30FC\u306F \n\u66F4\u65B0\u3055\u308C\u307E\u305B\u3093\u3002\u73FE\u5728\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u30B3\u30A2 \u30E6\u30FC\u30B6\u30FC\u3092\u4E0A\u66F8\u304D\u3059\u308B\u306B\u306F\u3001\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
ji.export.arg.description.skip-user-update=--update \u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u30AB\u30BF\u30ED\u30B0\u5185\u306E\u30E6\u30FC\u30B6\u30FC\u306F\u30A4\u30F3\u30DD\u30FC\u30C8 \n\u3055\u308C\u307E\u305B\u3093\u3002\u73FE\u5728\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u30E6\u30FC\u30B6\u30FC\u3092\u4E0A\u66F8\u304D\u305B\u305A\u306B\u30AB\u30BF\u30ED\u30B0\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B\u5834\u5408\u306B\u3001 \n\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002

ji.export.arg.description.update=\u30AB\u30BF\u30ED\u30B0\u5185\u306E\u30EA\u30BD\u30FC\u30B9\u304C\u30EA\u30DD\u30B8\u30C8\u30EA\u306E\u30EA\u30BD\u30FC\u30B9\u3068 URI \u3068\u30BF\u30A4\u30D7\u304C\u4E00\u81F4\u3059\u308B\u5834\u5408\u3001 \n\u30EA\u30DD\u30B8\u30C8\u30EA\u306E\u30EA\u30BD\u30FC\u30B9\u304C\u30AB\u30BF\u30ED\u30B0\u306E\u30EA\u30BD\u30FC\u30B9\u3067\u7F6E\u63DB\u3055\u308C\u307E\u3059\u3002

ji.export.arg.description.everything=\u30A2\u30AF\u30BB\u30B9 \u30A4\u30D9\u30F3\u30C8\u4EE5\u5916\u306E\u3059\u3079\u3066\u3092\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3057\u307E\u3059:\u3059\u3079\u3066\u306E\u30EA\u30DD\u30B8\u30C8\u30EA \u30EA\u30BD\u30FC\u30B9\u3001\u6A29\u9650\u3001 \u30EC\u30DD\u30FC\u30C8 \u30B8\u30E7\u30D6\u3001\u30E6\u30FC\u30B6\u30FC\u3001\u304A\u3088\u3073\u30ED\u30FC\u30EB\u3002

ji.export.arg.description.uris=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u307E\u305F\u306F\u30D5\u30A9\u30EB\u30C0\u306E\u30EA\u30DD\u30B8\u30C8\u30EA URI\u3002
ji.export.arg.description.repository-permissions=--uris \u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u5404\u30D5\u30A9\u30EB\u30C0\u3084\u30EA\u30BD\u30FC\u30B9\u3068\u3068\u3082\u306B \n\u30EA\u30DD\u30B8\u30C8\u30EA\u6A29\u9650\u304C\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
 
ji.export.arg.description.roles=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3059\u308B\u30ED\u30FC\u30EB\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u30ED\u30FC\u30EB\u3092\u6307\u5B9A\u3057\u306A\u3044\u5834\u5408\u3001 \u3059\u3079\u3066\u306E\u30ED\u30FC\u30EB\u304C\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
ji.export.arg.description.users=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u30E6\u30FC\u30B6\u30FC\u3092\u6307\u5B9A\u3057\u306A\u3044\u5834\u5408\u3001 \u3059\u3079\u3066\u306E\u30E6\u30FC\u30B6\u30FC\u304C\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
ji.export.arg.description.role-users=--roles \u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u5404\u30ED\u30FC\u30EB\u306B\u6240\u5C5E\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u304C\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002
ji.export.arg.description.users-roles=--users \u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3059\u308B\u3068\u3001\u5404\u30E6\u30FC\u30B6\u30FC\u306B\u6240\u5C5E\u3059\u308B\u30ED\u30FC\u30EB\u304C\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002

ji.export.arg.description.report-jobs=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u3066\u3044\u308B\u30B8\u30E7\u30D6\u3092\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u3001\n\u30EC\u30DD\u30FC\u30C8 \u30E6\u30CB\u30C3\u30C8\u3068\u30D5\u30A9\u30EB\u30C0 URI \u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002

ji.export.arg.description.prepend-path=\u30A4\u30F3\u30DD\u30FC\u30C8\u3057\u305F\u3059\u3079\u3066\u306E\u30EA\u30BD\u30FC\u30B9\u306E URI \u30D1\u30B9\u306E\u5148\u982D\u306B\u8FFD\u52A0\u3059\u308B\u6587\u5B57\u5217\u3002

ji.export.arg.description.pass=\u30A8\u30F3\u30B3\u30FC\u30C9\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002

ji.export.encryption.enc-pass=\n\n\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6697\u53F7\u5316\u3057\u3066\u3044\u307E\u3059:{0}\n
ji.export.encryption.add-string=\u6B21\u306E\u6587\u5B57\u5217\u3092 js.jdbc.properties \u306B\u8FFD\u52A0\u3057\u307E\u3059:

ji.export.arg.description.include-access-events=\u30A4\u30F3\u30DD\u30FC\u30C8\u307E\u305F\u306F\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u6642\u306B\u30A2\u30AF\u30BB\u30B9 \u30A4\u30D9\u30F3\u30C8\u3092\u542B\u3081\u307E\u3059\u3002

ji.export.arg.description.include-audit-events=\u30A4\u30F3\u30DD\u30FC\u30C8\u307E\u305F\u306F\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u6642\u306B\u76E3\u67FB\u30C7\u30FC\u30BF\u3092\u542B\u3081\u307E\u3059\u3002

ji.export.arg.description.include-monitoring-events=\u30A4\u30F3\u30DD\u30FC\u30C8\u307E\u305F\u306F\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u6642\u306B\u76E3\u8996\u30C7\u30FC\u30BF\u3092\u542B\u3081\u307E\u3059\u3002

ji.export.arg.description.include-server-settings=\u30B5\u30FC\u30D0\u30FC\u8A2D\u5B9A\u3092\u542B\u3081\u307E\u3059\u3002
ji.export.arg.description.include-attributes=\u5C5E\u6027\u3092\u542B\u3081\u307E\u3059\u3002
ji.export.arg.description.skip-attribute-values=\u5C5E\u6027\u5024\u3092\u30B9\u30AD\u30C3\u30D7\u3057\u307E\u3059\u3002
ji.export.arg.description.resource-types=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3059\u308B\u30EA\u30BD\u30FC\u30B9 \u30BF\u30A4\u30D7\u306E\u30AB\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8\u3002\u3059\u3079\u3066\u306E\u5229\u7528\u53EF\u80FD\u306A\u30EA\u30BD\u30FC\u30B9 \u30BF\u30A4\u30D7: {0}\u3002
ji.export.arg.description.skip-dependent-resources=\u4F9D\u5B58\u95A2\u4FC2\u306E\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u3092\u30B9\u30AD\u30C3\u30D7\u3057\u307E\u3059\u3002
ji.export.broken-dependencies=\u6B21\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u304C\u3042\u308A\u307E\u3059\u3002\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u4ED6\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002

ji.export.arg.description.broken-dependencies=\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u3067\u5B9F\u884C\u3059\u308B\u30A2\u30AF\u30B7\u30E7\u30F3 (fail\u3001skip\u3001include) \u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u306F [\u5931\u6557] \u3067\u3059\u3002\n fail - \u30B5\u30FC\u30D0\u30FC\u3067\u30A4\u30F3\u30DD\u30FC\u30C8\u304C\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u3001\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3059\u3002\n skip - \u30A4\u30F3\u30DD\u30FC\u30C8\u306F\u7D9A\u884C\u3055\u308C\u307E\u3059\u304C\u3001\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u306E\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u306F\u30A4\u30F3\u30DD\u30FC\u30C8\u3055\u308C\u307E\u305B\u3093\u3002\n include  - \u30A4\u30F3\u30DD\u30FC\u30C8\u306F\u7D9A\u884C\u3055\u308C\u3001\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u306E\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u3082\u30A4\u30F3\u30DD\u30FC\u30C8\u3055\u308C\u307E\u3059\u3002

import.broken.dependencies=\u30A4\u30F3\u30DD\u30FC\u30C8 \u30D5\u30A1\u30A4\u30EB\u306B\u3001\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u306E\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
import.broken.dependencies.options=\u300Cc\u300D\u3068\u5165\u529B\u3059\u308B\u3068\u3001\u30A4\u30F3\u30DD\u30FC\u30C8\u304C\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u307E\u3059\u3002\u300Cs\u300D\u3068\u5165\u529B\u3059\u308B\u3068\u3001\u30A4\u30F3\u30DD\u30FC\u30C8\u306F\u7D9A\u884C\u3055\u308C\u307E\u3059\u304C\u3001\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u306E\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u306F\u30B9\u30AD\u30C3\u30D7\u3055\u308C\u307E\u3059\u3002\u300Ci\u300D\u3068\u5165\u529B\u3059\u308B\u3068\u3001\u30A4\u30F3\u30DD\u30FC\u30C8\u304C\u7D9A\u884C\u3055\u308C\u3001\u58CA\u308C\u305F\u4F9D\u5B58\u95A2\u4FC2\u306E\u3042\u308B\u30EA\u30BD\u30FC\u30B9\u304C\u542B\u307E\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u300Cc\u300D\u3067\u3059\u3002

ji.export.organization.unsupported.operation=\u30EA\u30DD\u30B8\u30C8\u30EA URI {0} \u306E\u30EA\u30BD\u30FC\u30B9\u306F\u7D44\u7E54\u3067\u3059\u3002\nJasperReports Server \u306F\u3001\u500B\u5225\u306E\u7D44\u7E54\u306E\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002

ji.export.arg.description.input-key=\u30A4\u30F3\u30DD\u30FC\u30C8/\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u6697\u53F7\u306E\u79D8\u5BC6\u30AD\u30FC\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.keyalias=\u30AD\u30FC\u30B9\u30C8\u30A2\u5185\u306E\u30AD\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.keypass=\u30AD\u30FC\u30B9\u30C8\u30A2\u5185\u306E\u30AD\u30FC\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.keyalg=\u6697\u53F7\u5316\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.keysize=\u30AD\u30FC \u30B5\u30A4\u30BA\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.keystore=Java \u30AD\u30FC\u30B9\u30C8\u30A2\u304B\u3089\u30AD\u30FC\u3092\u30A4\u30F3\u30DD\u30FC\u30C8\u3059\u308B
ji.export.arg.description.secret-key=\u79D8\u5BC6\u30AD\u30FC\u306E\u30D0\u30A4\u30C8\u3092 16 \u9032\u6570\u3067\u6307\u5B9A\u3059\u308B\u3002
ji.export.arg.description.storepass=\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.genkey=\u65B0\u3057\u3044\u30AD\u30FC\u3092\u30E9\u30F3\u30C0\u30E0\u306B\u751F\u6210\u3057\u3066\u30C7\u30FC\u30BF\u3092\u6697\u53F7\u5316\u3059\u308B
ji.export.arg.description.secretUri=\u79D8\u5BC6\u30D5\u30A1\u30A4\u30EB\u306E\u30EA\u30DD\u30B8\u30C8\u30EA\u306E\u5834\u6240\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.destkeystore=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u7528\u306E\u5B9B\u5148\u30AD\u30FC\u30B9\u30C8\u30A2\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.deststorepass=\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u7528\u306E\u5B9B\u5148\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.destkeypass=\u5165\u529B\u30AD\u30FC\u30A8\u30A4\u30EA\u30A2\u30B9\u306E\u5B9B\u5148\u30AD\u30FC\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.visible=UI \u3067\u306E\u30AD\u30FC\u306E\u53EF\u8996\u6027\u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.keylabel=UI \u3067\u4F7F\u7528\u3059\u308B\u30AD\u30FC\u306E\u30E9\u30D9\u30EB\u3092\u6307\u5B9A
ji.export.arg.description.keyorganisation=\u3053\u306E\u30AD\u30FC\u304C\u5C5E\u3059\u308B\u7D44\u7E54 ID \u3092\u6307\u5B9A\u3059\u308B
ji.export.arg.description.calendars=\u30B9\u30B1\u30B8\u30E5\u30FC\u30E9\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u3059\u3079\u3066\u306E\u30BF\u30A4\u30D7\uFF08\u4F11\u65E5\u3001\u7E70\u308A\u8FD4\u3057\u306A\u3069\uFF09\u306E\u30AB\u30EC\u30F3\u30C0\u30FC\u3092\u6307\u5B9A\u3059\u308B