#
# Copyright (C) 2005 - 2019 TIBCO Software Inc. All rights reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

JAM_001_EDIT_PROPERTIES_TITLE=OLAP-Einstellungen verwalten
JAM_003_PROFILING_ENABLED=Leistungsprofile aktiviert
JAM_004_XMLA_MAX_DRILL_THROUGH=H\u00f6chstanzahl XML/A-Zeilen f\u00fcr vollst\u00e4ndige Aufschl\u00fcsselung
JAM_005_DISABLE_MEMORY_CACHE=OLAP-Speichercache deaktivieren
JAM_006_GENERATE_FORMATTED_SQL=Formatierte SQL-Ablaufverfolgung generieren
JAM_007_TRACE_LEVEL=Ablaufverfolgungsebene (bei SQL-Abfragen auf einen Wert gr\u00f6\u00dfer als 0 festlegen)
JAM_008_TRACE_FILE=Ausgabedatei f\u00fcr Ablaufverfolgung ("null" f\u00fcr Standardausgabe)
JAM_009_QUERY_LIMIT=Abfragelimit
JAM_010_RESULT_LIMIT=Ergebnislimit (Zeilenanzahl)
JAM_011_LARGE_DIMENSION_THRESHOLD=Schwellenwert f\u00fcr gro\u00dfe Dimension
JAM_012_SPARSE_DENSITY_THRESHOLD=Schwellenwert f\u00fcr geringe Segmentdichte
JAM_013_SPARSE_COUNT_THRESHOLD=Schwellenwert f\u00fcr geringe Segmentanzahl (Anzahl Zellenwerte)
JAM_014_ENABLE_AGGREGATES=Aggregattabellen aktivieren
JAM_015_CHOOSE_AGGREGATES_BY_VOL=Aggregattabelle nach Volumen ausw\u00e4hlen
JAM_016_VIEW_PROPERTIES_TITLE=OLAP-Server-Eigenschaften anzeigen
JAM_017_VIEW_PROPERTIES_HEADER=OLAP-Server-Eigenschaften
JAM_018_ERROR=Fehler
JAM_019_WHOLE_NUMBER_ERROR=Dieser Wert muss eine ganze Zahl sein.
JAM_020_RATIO_NUMBER_ERROR=Dieser Wert muss ein Verh\u00e4ltnis zwischen 0,0 und 1,0 sein.
JAM_021_ERROR_HEADING=OLAP-Fehler
JAM_022_ANALYSIS_LICENSE_MISSING=F\u00fcr den Zugriff auf diese Seite ben\u00f6tigen Sie eine Lizenz mit Jaspersoft-OLAP-Berechtigungen. 
JAM_023_CONTACT_SUPPORT=Wenden Sie sich an den technischen Support von Jaspersoft.

JAM_022_EVALUATE_MAX_EVAL_DEPTH=Maximal zul\u00e4ssige Anzahl der Durchl\u00e4ufe bei der Auswertung eines MDX-Ausdrucks
JAM_024_CASE_SENSITIVE=Bei MDX-Bezeichnern werden Gro\u00df- und Kleinschreibung unterschieden.
JAM_023_COMPARE_SIBLINGS_BY_ORDER_KEY=Gleichgeordnete Member werden nach ihrem jeweiligen Ordinalausdruck angeordnet
JAM_025_QUERY_TIMEOUT=Wenn > 0, maximale Abfragezeit (Anzahl Sekunden)
JAM_024_NON_EMPTY=Nicht leer wird immer verwendet
JAM_025_IGNORE_INVALID_MEMBERS=Beim Laden des Schemas werden ung\u00fcltige Member ignoriert und als NULL behandelt
JAM_026_IGNORE_INVALID_MEMBERS_DURING_QUERY=Beim Pr\u00fcfen der G\u00fcltigkeit der Abfrage werden ung\u00fcltige Member ignoriert und als NULL behandelt
JAM_027_NULL_MEMBER_REPRESENTATION=Legt fest, wie ein NULL-Member in der Ergebnisausgabe dargestellt wird.
JAM_028_ITERATION_LIMIT=Wenn > 0, die beim Auswerten eines Aggregats maximal zul\u00e4ssige Anzahl von Iterationen
JAM_029_OPTIMIZER_SIZE=Wenn > 0, CrossJoin-Ergebnislimit, bei dessen \u00dcberschreiten der Optimierer angewendet wird (Anzahl Zeilen)
JAM_032_NEED_DIMENSION_PREFIX=Muss Elementen einer Dimension (Ebenen, Hierarchien, Member) in der MDX-Abfrage der Dimensionsname vorangestellt werden?
JAM_033_IGNORE_MEASURE_FOR_NON_JOINING_PREFIX=Wenn Dimensionen vorhanden sind, die bei der Aggregation keinem Ma\u00df im Kontext zugeordnet sind, wird das Ma\u00df im Auswertungskontext ignoriert.
JAM_031_NULL_OR_ZERO_DENOMINATOR_PRODUCES_NULL=Die Division durch NULL oder 0 ergibt NULL.
JAM_030_SOLVE_ORDER_MODE=Auswertungsverhalten f\u00fcr Aufl\u00f6sungsreihenfolge
JAM_HEADER_GENERAL_BEHAVIOR=Allgemeines Verhalten
JAM_014_AGGREGATE_SECTION=Aggregateinstellungen
JAM_016_AGGREGATES_OPTIMIZE_PREDICATES=Pr\u00e4dikate optimieren
JAM_017_AGGREGATES_RULES=Regeldatei f\u00fcr Identifizierung der Aggregattabellen
JAM_018_AGGREGATES_RULE_TAG=Tagwert des AggRule-Elements
JAM_019_AGGREGATES_GENERATE_SQL=SQL zum Erstellen von Aggregattabellen in Protokoll ausgeben, um MDX mit Aggregaten zu unterst\u00fctzen
JAM_020_AGGREGATES_JDBC_FACTORY_CLASS=Factory-Klasse zum Bestimmen der Tabellen und Spalten einer Datenquelle
JAM_034_CACHING_SECTION=Einstellungen f\u00fcr Cache und SQL-Erzeugung
JAM_035_EXP_CACHE_ENABLE=Cache f\u00fcr die Ergebnisse h\u00e4ufig verwendeter Ausdr\u00fccke verwenden
JAM_036_ENABLE_CUBE_MEMBER_CACHE=RolapCubeMember-Objekte zwischenspeichern
JAM_037_NATIVE_CROSS_JOIN_ENABLE=Einige NICHT LEERE CrossJoin-MDX-Anweisungen werden in der Datenbank berechnet.
JAM_038_NATIVE_TOP_COUNT_ENABLE=Einige TopCount-MDX-Anweisungen werden in der Datenbank berechnet.
JAM_039_NATIVE_FILTER_ENABLE=Einige Filter()-MDX-Anweisungen werden in der Datenbank berechnet.
JAM_040_NATIVE_NON_EMPTY_ENABLE=Einige NICHT LEERE MDX-Anweisungen werden in der Datenbank berechnet.
JAM_048_NATIVE_UNSUPPORTED_ALERT=Warnaktion, wenn die systemeigene Auswertung einer Funktion aktiviert ist, in einer bestimmten Abfrage jedoch nicht unterst\u00fctzt wird
JAM_041_GROUPING_SETS_ENABLE=Einige verdichtende Abfragen werden durch Gruppieren nach Gruppierungss\u00e4tzen kombiniert, sofern vom SQL-Dialekt zugelassen.
JAM_043_XMLA_SECTION=XML/A-Einstellungen
JAM_042_XMLA_DRILL_THROUGH_TOTAL_COUNT_ENABLE=Die erste Zeile im Ergebnis einer Anforderung f\u00fcr eine vollst\u00e4ndige XML/A-Aufschl\u00fcsselung enth\u00e4lt die Gesamtanzahl der Zeilen.
JAM_044_MEMORY_MONITOR_SECTION=Einstellungen f\u00fcr Speicher\u00fcberwachung
JAM_045_MEMORY_MONITOR_ENABLE=Java-Speicher\u00fcberwachung verwenden, um Speicher\u00fcberlauf zu vermeiden
JAM_046_MEMORY_MONITOR_THRESHOLD=Schwellenwert f\u00fcr Beschr\u00e4nkung der Speicherverwendung (Prozent des Gesamtspeichers)
JAM_047_MEMORY_MONITOR_CLASS=Klassename der Factory f\u00fcr die Speicherverwaltung

JAM_048_ZERO_OR_GREATER=Dieser Wert muss 0 oder gr\u00f6\u00dfer sein.
JAM_049_ONE_OR_GREATER=Dieser Wert muss eins oder gr\u00f6\u00dfer sein.
JAM_050_ONE_TO_99=Dieser Wert muss zwischen 1 und 99 liegen.
JAM_051_INVALID_CLASS=Ung\u00fcltiger Klassenname. Er ist auf dem Server nicht vorhanden.
JAM_052_EXP_CALC_CLASS=Klassennname f\u00fcr zu verwendenden ExpCompiler

JAM_053_EXPAND_NON_NATIVE=Nicht systemeigene untergeordnete Ausdr\u00fccke eines systemeigenen Ausdrucks in MemberLists erweitern
JAM_054_MAX_CONSTRAINTS=Maximale Anzahl von Einschr\u00e4nkungen in einer einzelnen 'IN'-SQL-Klausel
JAM_055_HIGH_CARD_CHUNK_SIZE=Anzahl der beim Verarbeiten von Dimensionselementen mit hoher Kardinali\u00e4t gelesenen Member

JAM_056_UPDATED=Einstellung wurde aktualisiert
JAM_057_DONE=Fertig

JAM_058_MONITOR_EXECUTION_HISTORY_SIZE=Die Anzahl von vorherigen Ausf\u00fchrungsinstanzen, die Jaspersoft OLAP im Verlauf aufbewahrt
JAM_059_SEGMENT_CACHE=Definiert, welche SegmentCache-Implementierung verwendet werden soll
JAM_060_MAX_CACHE_THREADS=Maximalzahl von Threads pro Jaspersoft OLAP-Instanz, die zum Ausf\u00fchren von Operationen auf externen Caches verwendet wird
JAM_061_MAX_SQL_THREAD=Maximalzahl von Threads pro Jaspersoft OLAP-Instanz, die zum Ausf\u00fchren von SQL-Abfragen beim F\u00fcllen von Segmenten mit Daten verwendet wird
JAM_062_DISABLE_LOCAL_SEGMENT_CACHE=Legt fest, ob die Daten aus Segmenten lokal zwischengespeichert werden
JAM_063_CELL_BATCH_SIZE=Wenn > 0, die Anzahl von Zellen, die beim Aufbauen von Segmenten zusammengefasst werden
JAM_064_ENABLE_IN_MEMORY_ROLLUP=Wenn aktiviert, erfolgen Roll-ups von Segmentdaten im Speicher
JAM_065_FILTER_CHILD_LESS_SNOW_FLAKE_MEMBERS=Wenn aktiviert, sind einige Abfragen von Mitgliedern von Schneeflockendimensionen auf hoher Ebener ressourcenintensiver
JAM_066_MAX_QUERY_THREADS=Maximalzahl von MDX-Abfragethreads pro Jaspersoft OLAP-Instanz
JAM_067_SHEPHERD_THREAD_POLLING_INTERVAL=Intervall zwischen Abfrageoperationen durch den RolapConnection-Shepherd-Thread
JAM_068_SCHEMA_REFRESH_INTERVAL=Intervall zwischen Aktualisierungen der Liste von XML/A-Katalogen
JAM_069_STATISTICS_PROVIDER=Durch Kommas getrennte Liste der zu verwendenden Klassen zum Abrufen von Statistiken zur Anzahl der Zeilen in einer Tabelle
JAM_070_ENABLE_DRILL_THROUGH=Wenn deaktiviert, gibt Jaspersoft OLAP eine Ausnahme zur\u00fcck, wenn Benutzer eine vollst\u00e4ndige Aufschl\u00fcsselung durchf\u00fchren

JAM_071_MAX_FILTER_COUNT=Maximale Anzahl von Filterwerten in einer OLAP-basierten Ad-hoc-Ansicht
JAM_072_READ_AGGREGATE_TABLES=Aggregattabellen lesen




