#
# Copyright (C) 2005 - 2019 TIBCO Software Inc. All rights reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

JAM_001_EDIT_PROPERTIES_TITLE=Gerenciar configura\u00e7\u00f5es OLAP
JAM_003_PROFILING_ENABLED=Perfil de desempenho ativado
JAM_004_XMLA_MAX_DRILL_THROUGH=M\u00e1ximo de linhas de navega\u00e7\u00e3o de detalhes de XML/A
JAM_005_DISABLE_MEMORY_CACHE=Desativar cache de mem\u00f3ria OLAP
JAM_006_GENERATE_FORMATTED_SQL=Gerar rastreamentos SQL formatados
JAM_007_TRACE_LEVEL=N\u00edvel de rastreamento (definir como maior de 0 para consultas SQL)
JAM_008_TRACE_FILE=Arquivo de sa\u00edda de rastreamento -- nulo para std out
JAM_009_QUERY_LIMIT=Limite da consulta
JAM_010_RESULT_LIMIT=Limite de resultados (n\u00famero de linhas)
JAM_011_LARGE_DIMENSION_THRESHOLD=Limite de dimens\u00e3o grande
JAM_012_SPARSE_DENSITY_THRESHOLD=Limite de densidade de segmento esparso
JAM_013_SPARSE_COUNT_THRESHOLD=Limite de contagem de segmento esparso (n\u00famero de valores de c\u00e9lulas)
JAM_014_ENABLE_AGGREGATES=Ativar tabelas agregadas
JAM_015_CHOOSE_AGGREGATES_BY_VOL=Escolher tabela agregada por volume
JAM_016_VIEW_PROPERTIES_TITLE=Visualizar propriedades do servidor OLAP
JAM_017_VIEW_PROPERTIES_HEADER=Propriedades do servidor OLAP
JAM_018_ERROR=Erro
JAM_019_WHOLE_NUMBER_ERROR=esse valor deve ser um n\u00famero inteiro.
JAM_020_RATIO_NUMBER_ERROR=esse valor deve ser uma raz\u00e3o entre 0,0 e 1,0.
JAM_021_ERROR_HEADING=Erro OLAP
JAM_022_ANALYSIS_LICENSE_MISSING=Para acessar esta p\u00e1gina voc\u00ea precisa de uma licen\u00e7a com privil\u00e9gios OLAP da Jaspersoft. 
JAM_023_CONTACT_SUPPORT=Entre em contato com o suporte t\u00e9cnico da Jaspersoft.

JAM_022_EVALUATE_MAX_EVAL_DEPTH=N\u00famero m\u00e1ximo de passes permitidos ao avaliar uma express\u00e3o MDX
JAM_024_CASE_SENSITIVE=Identificadores MDX diferenciam mai\u00fasculas de min\u00fasculas
JAM_023_COMPARE_SIBLINGS_BY_ORDER_KEY=Membros irm\u00e3os s\u00e3o classificados de acordo com sua express\u00e3o ordinal
JAM_025_QUERY_TIMEOUT=Se> 0, tempo m\u00e1ximo de consulta (n\u00famero de segundos)
JAM_024_NON_EMPTY=N\u00e3o vazio sempre usado
JAM_025_IGNORE_INVALID_MEMBERS=Durante carregamento do esquema, os membros inv\u00e1lidos s\u00e3o ignorados e ser\u00e3o tratados como um nulo
JAM_026_IGNORE_INVALID_MEMBERS_DURING_QUERY=Durante a valida\u00e7\u00e3o da consulta, os membros inv\u00e1lidos s\u00e3o ignorados e ser\u00e3o tratados como um nulo
JAM_027_NULL_MEMBER_REPRESENTATION=Define como um membro nulo \u00e9 representado na sa\u00edda de resultados
JAM_028_ITERATION_LIMIT=Se >0, o n\u00famero m\u00e1ximo de itera\u00e7\u00f5es permitidas ao avaliar um agregado
JAM_029_OPTIMIZER_SIZE=Se > 0, o limite de resultado da jun\u00e7\u00e3o cruzada al\u00e9m do qual o otimizador ser\u00e1 aplicado (n\u00famero de linhas)
JAM_032_NEED_DIMENSION_PREFIX=\u00c9 preciso que os elementos de uma dimens\u00e3o (n\u00edveis, hierarquias, membros) sejam prefixados com o nome de dimens\u00e3o na consulta MDX
JAM_033_IGNORE_MEASURE_FOR_NON_JOINING_PREFIX=Se h\u00e1 dimens\u00f5es n\u00e3o relacionadas a uma medida no contexto durante a agrega\u00e7\u00e3o, a medida \u00e9 ignorada no contexto da avalia\u00e7\u00e3o.
JAM_031_NULL_OR_ZERO_DENOMINATOR_PRODUCES_NULL=Divis\u00e3o por nulo ou zero produz NULO
JAM_030_SOLVE_ORDER_MODE=Resolver comportamento de avalia\u00e7\u00e3o de ordem
JAM_HEADER_GENERAL_BEHAVIOR=Comportamento geral
JAM_014_AGGREGATE_SECTION=Configura\u00e7\u00f5es agregadas
JAM_016_AGGREGATES_OPTIMIZE_PREDICATES=Otimizar predicados
JAM_017_AGGREGATES_RULES=Arquivo de regra para identifica\u00e7\u00e3o de tabela agregada
JAM_018_AGGREGATES_RULE_TAG=Valor da tag do elemento do AggRule
JAM_019_AGGREGATES_GENERATE_SQL=Imprimir SQL para registrar o log de cria\u00e7\u00e3o de tabela agregada para suportar MDX com agregados
JAM_020_AGGREGATES_JDBC_FACTORY_CLASS=Classe de f\u00e1brica para determinar as tabelas e colunas de uma fonte de dados
JAM_034_CACHING_SECTION=Configura\u00e7\u00f5es de cache e gera\u00e7\u00e3o de SQL
JAM_035_EXP_CACHE_ENABLE=Usar um cache para os resultados de express\u00f5es frequentemente avaliadas
JAM_036_ENABLE_CUBE_MEMBER_CACHE=Objetos de RolapCubeMember do cache
JAM_037_NATIVE_CROSS_JOIN_ENABLE=Algumas declara\u00e7\u00f5es NON EMPTY CrossJoin MDX ser\u00e3o computadas no banco de dados
JAM_038_NATIVE_TOP_COUNT_ENABLE=Algumas declara\u00e7\u00f5es TopCount MDX ser\u00e3o computadas no banco de dados
JAM_039_NATIVE_FILTER_ENABLE=Algumas declara\u00e7\u00f5es Filter() MDX ser\u00e3o computadas no banco de dados
JAM_040_NATIVE_NON_EMPTY_ENABLE=Algumas declara\u00e7\u00f5es NON EMPTY MDX ser\u00e3o computadas no banco de dados
JAM_048_NATIVE_UNSUPPORTED_ALERT=A\u00e7\u00e3o de alerta caso a avalia\u00e7\u00e3o nativa de uma fun\u00e7\u00e3o esteja ativada, mas n\u00e3o seja suportada em uma consulta espec\u00edfica
JAM_041_GROUPING_SETS_ENABLE=Algumas consultas cumulativas ser\u00e3o combinadas usando grupos por conjunto de agrupamento, se o dialeto SQL permitir isso
JAM_043_XMLA_SECTION=Configura\u00e7\u00f5es XML/A
JAM_042_XMLA_DRILL_THROUGH_TOTAL_COUNT_ENABLE=A primeira linha no resultado de uma solicita\u00e7\u00e3o de navega\u00e7\u00e3o de detalhes de XML/A ser\u00e1 preenchida com a contagem total de linhas.
JAM_044_MEMORY_MONITOR_SECTION=Configura\u00e7\u00f5es de monitoramento de mem\u00f3ria
JAM_045_MEMORY_MONITOR_ENABLE=Usar monitoramento de mem\u00f3ria Java para evitar a falta de mem\u00f3ria
JAM_046_MEMORY_MONITOR_THRESHOLD=Limite para limitar a mem\u00f3ria usada (porcentagem de mem\u00f3ria total)
JAM_047_MEMORY_MONITOR_CLASS=Nome da classe de f\u00e1brica para gerenciar a mem\u00f3ria

JAM_048_ZERO_OR_GREATER=esse valor deve ser igual ou maior que zero
JAM_049_ONE_OR_GREATER=esse valor deve ser igual ou maior que um
JAM_050_ONE_TO_99=este valor deve estar entre 1 e 99
JAM_051_INVALID_CLASS=Nome da classe inv\u00e1lido. N\u00e3o existe no servidor.
JAM_052_EXP_CALC_CLASS=Nome da classe de ExpCompiler a ser usado

JAM_053_EXPAND_NON_NATIVE=Expandir subexpress\u00f5es n\u00e3o nativas de uma express\u00e3o nativa em MemberLists
JAM_054_MAX_CONSTRAINTS=N\u00famero m\u00e1ximo de restri\u00e7\u00f5es em uma \u00fanica cl\u00e1usula SQL 'IN'
JAM_055_HIGH_CARD_CHUNK_SIZE=N\u00famero de membros lidos ao processar elementos de dimens\u00e3o de alta cardinalidade

JAM_056_UPDATED=Configura\u00e7\u00f5es atualizadas
JAM_057_DONE=Conclu\u00eddo

JAM_058_MONITOR_EXECUTION_HISTORY_SIZE=O n\u00famero de inst\u00e2ncias de execu\u00e7\u00e3o anteriores que o OLAP da Jaspersoft mant\u00e9m em seu hist\u00f3rico
JAM_059_SEGMENT_CACHE=Define qual implementa\u00e7\u00e3o de SegmentCache usar
JAM_060_MAX_CACHE_THREADS=N\u00famero m\u00e1ximo de threads por inst\u00e2ncia OLAP da Jaspersoft usado para executar opera\u00e7\u00f5es em caches externos
JAM_061_MAX_SQL_THREAD=N\u00famero m\u00e1ximo de threads por inst\u00e2ncia OLAP da Jaspersoft usado para executar consultas de SQL ao preencher segmentos
JAM_062_DISABLE_LOCAL_SEGMENT_CACHE=Determina se os dados dos segmentos s\u00e3o armazenados em cache localmente
JAM_063_CELL_BATCH_SIZE=Se > 0, o n\u00famero de c\u00e9lulas que s\u00e3o agrupadas juntas ao criar segmentos
JAM_064_ENABLE_IN_MEMORY_ROLLUP=Se ativado, os dados do segmento s\u00e3o distribu\u00eddos na mem\u00f3ria
JAM_065_FILTER_CHILD_LESS_SNOW_FLAKE_MEMBERS=Se ativado, algumas consultas contra membros de alto n\u00edvel das dimens\u00f5es floco-de-neve s\u00e3o mais caras
JAM_066_MAX_QUERY_THREADS=N\u00famero m\u00e1ximo de threads de consulta MDX por inst\u00e2ncia OLAP da Jaspersoft.
JAM_067_SHEPHERD_THREAD_POLLING_INTERVAL=Intervalo entre opera\u00e7\u00f5es de sondagem executadas pelo thread pastor RolapConnection
JAM_068_SCHEMA_REFRESH_INTERVAL=Intervalo entre atualiza\u00e7\u00f5es \u00e0 lista dos cat\u00e1logos XML/A
JAM_069_STATISTICS_PROVIDER=Listas de classes separadas por v\u00edrgula para usar para obter estat\u00edsticas sobre o n\u00famero de linhas em uma tabela
JAM_070_ENABLE_DRILL_THROUGH=De desativado, o Jaspersoft OLAP retorna uma exce\u00e7\u00e3o quando os usu\u00e1rios navegam os detalhes

JAM_071_MAX_FILTER_COUNT=N\u00famero m\u00e1ximo de valores de filtro em uma exibi\u00e7\u00e3o ad-hoc baseada em OLAP
JAM_072_READ_AGGREGATE_TABLES=Ativar tabelas agregadas




