#
# Copyright (C) 2005 - 2019 TIBCO Software Inc. All rights reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

JAM_001_EDIT_PROPERTIES_TITLE=G\u00e9rer les param\u00e8tres OLAP
JAM_003_PROFILING_ENABLED=Profilage des performances activ\u00e9
JAM_004_XMLA_MAX_DRILL_THROUGH=XML/A Zoom transversal maximal sur les lignes
JAM_005_DISABLE_MEMORY_CACHE=D\u00e9sactiver la mise en cache de la m\u00e9moire OLAP
JAM_006_GENERATE_FORMATTED_SQL=G\u00e9n\u00e9rer des traces SQL format\u00e9es
JAM_007_TRACE_LEVEL=Niveau de trace (d\u00e9finir une valeur sup\u00e9rieure \u00e0 0 pour les requ\u00eates SQL)
JAM_008_TRACE_FILE=Fichier de sortie des traces \u2013 nul pour std out
JAM_009_QUERY_LIMIT=Nombre limite de requ\u00eates
JAM_010_RESULT_LIMIT=Nombre limite de r\u00e9sultats (nombre de lignes)
JAM_011_LARGE_DIMENSION_THRESHOLD=Seuil de la grande dimension
JAM_012_SPARSE_DENSITY_THRESHOLD=Seuil de densit\u00e9 de segment \u00e9pars
JAM_013_SPARSE_COUNT_THRESHOLD=Seuil de d\u00e9nombrement de segments \u00e9pars (nombre de valeurs de cellule)
JAM_014_ENABLE_AGGREGATES=Activer les tables d\u2019agr\u00e9gats
JAM_015_CHOOSE_AGGREGATES_BY_VOL=S\u00e9lectionner la table d\u2019agr\u00e9gats par volume
JAM_016_VIEW_PROPERTIES_TITLE=Afficher les propri\u00e9t\u00e9s du serveur OLAP
JAM_017_VIEW_PROPERTIES_HEADER=Propri\u00e9t\u00e9s du serveur OLAP
JAM_018_ERROR=Erreur
JAM_019_WHOLE_NUMBER_ERROR=cette valeur doit \u00eatre un nombre entier.
JAM_020_RATIO_NUMBER_ERROR=cette valeur doit \u00eatre un ratio compris entre 0,0 et 1,0.
JAM_021_ERROR_HEADING=Erreur OLAP
JAM_022_ANALYSIS_LICENSE_MISSING=Pour acc\u00e9der \u00e0 cette page, une licence avec des droits OLAP Jaspersoft est requise. 
JAM_023_CONTACT_SUPPORT=Veuillez contacter l'assistance technique de JasperSoft.

JAM_022_EVALUATE_MAX_EVAL_DEPTH=Nombre maximal de passes autoris\u00e9es lors de l\u2019\u00e9valuation d\u2019une expression MDX
JAM_024_CASE_SENSITIVE=Les identifiants MDX sont sensibles \u00e0 la casse.
JAM_023_COMPARE_SIBLINGS_BY_ORDER_KEY=Les membres apparent\u00e9s sont organis\u00e9s en fonction de leur expression ordinale.
JAM_025_QUERY_TIMEOUT=Si > 0, dur\u00e9e de requ\u00eate maximale (nombre de secondes)
JAM_024_NON_EMPTY=Non vide toujours utilis\u00e9
JAM_025_IGNORE_INVALID_MEMBERS=Pendant le chargement du sch\u00e9ma, les membres non valides sont ignor\u00e9s et seront trait\u00e9s comme nuls.
JAM_026_IGNORE_INVALID_MEMBERS_DURING_QUERY=Pendant la validation de la requ\u00eate, les membres non valides sont ignor\u00e9s et seront trait\u00e9s comme nuls.
JAM_027_NULL_MEMBER_REPRESENTATION=Permet de d\u00e9finir comment un membre nul est repr\u00e9sent\u00e9 dans la sortie des r\u00e9sultats.
JAM_028_ITERATION_LIMIT=Si >\u00a00, le nombre maximal d\u2019it\u00e9rations autoris\u00e9es pendant l\u2019\u00e9valuation d\u2019un agr\u00e9gat
JAM_029_OPTIMIZER_SIZE=Si >\u00a00, la limite du r\u00e9sultat de la liaison crois\u00e9e au-del\u00e0 de laquelle l\u2019optimiseur sera appliqu\u00e9 (nombre de lignes)
JAM_032_NEED_DIMENSION_PREFIX=Dans une requ\u00eate MDX, est-il n\u00e9cessaire d\u2019ajouter en pr\u00e9fixe le nom de la dimension aux \u00e9l\u00e9ments d\u2019une dimension (niveaux, hi\u00e9rarchies, membres) ?
JAM_033_IGNORE_MEASURE_FOR_NON_JOINING_PREFIX=Durant l\u2019agr\u00e9gation, en pr\u00e9sence de dimensions sans lien avec une mesure en contexte, la mesure est ignor\u00e9e dans le contexte de l'\u00e9valuation.
JAM_031_NULL_OR_ZERO_DENOMINATOR_PRODUCES_NULL=La division par nul ou z\u00e9ro produit un r\u00e9sultat NUL.
JAM_030_SOLVE_ORDER_MODE=R\u00e9soudre le comportement d\u2019\u00e9valuation de l\u2019ordre
JAM_HEADER_GENERAL_BEHAVIOR=Comportement global
JAM_014_AGGREGATE_SECTION=Param\u00e8tres d\u2019agr\u00e9gat
JAM_016_AGGREGATES_OPTIMIZE_PREDICATES=Optimiser les pr\u00e9dicats
JAM_017_AGGREGATES_RULES=Fichier de r\u00e8gles pour l\u2019identification de tables d\u2019agr\u00e9gats
JAM_018_AGGREGATES_RULE_TAG=Valeur de la balise de l\u2019\u00e9l\u00e9ment AggRule
JAM_019_AGGREGATES_GENERATE_SQL=Enregistrer SQL dans le journal pour la cr\u00e9ation de tables d\u2019agr\u00e9gats en vue de la prise en charge de MDX avec des agr\u00e9gats
JAM_020_AGGREGATES_JDBC_FACTORY_CLASS=Classe d\u2019objets pour d\u00e9terminer les tables et les colonnes d\u2019une source de donn\u00e9es
JAM_034_CACHING_SECTION=Param\u00e8tres de g\u00e9n\u00e9ration SQL et du cache
JAM_035_EXP_CACHE_ENABLE=Utiliser un cache pour les r\u00e9sultats des expressions \u00e9valu\u00e9es fr\u00e9quemment
JAM_036_ENABLE_CUBE_MEMBER_CACHE=Mettre les objets RolapCubeMember en cache
JAM_037_NATIVE_CROSS_JOIN_ENABLE=Certaines instructions MDX CrossJoin NON VIDES seront calcul\u00e9es dans la base de donn\u00e9es.
JAM_038_NATIVE_TOP_COUNT_ENABLE=Certaines instructions MDX TopCount seront calcul\u00e9es dans la base de donn\u00e9es.
JAM_039_NATIVE_FILTER_ENABLE=Certaines instructions MDX Filter() seront calcul\u00e9es dans la base de donn\u00e9es.
JAM_040_NATIVE_NON_EMPTY_ENABLE=Certaines instructions MDX NON VIDES seront calcul\u00e9es dans la base de donn\u00e9es.
JAM_048_NATIVE_UNSUPPORTED_ALERT=L\u2019action d\u2019alerte en cas d\u2019\u00e9valuation native d\u2019une fonction est activ\u00e9e mais n\u2019est pas prise en charge dans une requ\u00eate en particulier.
JAM_041_GROUPING_SETS_ENABLE=Certaines requ\u00eates de cumul seront combin\u00e9es \u00e0 l\u2019aide de groupes en associant des ensembles d\u00e8s lors que le langage SQL le permet.
JAM_043_XMLA_SECTION=Param\u00e8tres XML/A
JAM_042_XMLA_DRILL_THROUGH_TOTAL_COUNT_ENABLE=La premi\u00e8re ligne des r\u00e9sultats d\u2019une requ\u00eate de zoom transversal XML/A sera renseign\u00e9e \u00e0 l\u2019aide des totaux des lignes.
JAM_044_MEMORY_MONITOR_SECTION=Param\u00e8tres de surveillance de la m\u00e9moire
JAM_045_MEMORY_MONITOR_ENABLE=Utiliser la surveillance de la m\u00e9moire Java pour \u00e9viter tout d\u00e9passement de m\u00e9moire
JAM_046_MEMORY_MONITOR_THRESHOLD=Seuil maximum d'utilisation de la m\u00e9moire (pourcentage de la m\u00e9moire totale)
JAM_047_MEMORY_MONITOR_CLASS=Nom de classe d\u2019objets pour g\u00e9rer la m\u00e9moire

JAM_048_ZERO_OR_GREATER=cette valeur doit \u00eatre sup\u00e9rieure ou \u00e9gale \u00e0 z\u00e9ro.
JAM_049_ONE_OR_GREATER=cette valeur doit \u00eatre sup\u00e9rieure ou \u00e9gale \u00e0 un.
JAM_050_ONE_TO_99=cette valeur doit \u00eatre comprise entre 1 et 99.
JAM_051_INVALID_CLASS=Nom de classe non valide. N\u2019existe pas sur le serveur.
JAM_052_EXP_CALC_CLASS=Nom de classe ExpCompiler \u00e0 utiliser

JAM_053_EXPAND_NON_NATIVE=D\u00e9velopper les sous-expressions non natives d\u2019une expression native dans MemberLists
JAM_054_MAX_CONSTRAINTS=Nombre maximal de contraintes dans une seule clause SQL \u00ab\u00a0IN\u00a0\u00bb
JAM_055_HIGH_CARD_CHUNK_SIZE=Nombre de lectures de membres lors du traitement d\u2019\u00e9l\u00e9ments de dimension \u00e0 forte cardinalit\u00e9

JAM_056_UPDATED=Param\u00e8tre mis \u00e0 jour
JAM_057_DONE=Termin\u00e9

JAM_058_MONITOR_EXECUTION_HISTORY_SIZE=Nombre d'instances d'ex\u00e9cution pr\u00e9c\u00e9dentes que Jaspersoft OLAP conserve dans son historique
JAM_059_SEGMENT_CACHE=D\u00e9finit l'impl\u00e9mentation de SegmentCache \u00e0 utiliser.
JAM_060_MAX_CACHE_THREADS=Nombre maximal de fils par instance de Jaspersoft OLAP utilis\u00e9s pour ex\u00e9cuter des op\u00e9rations sur les caches externes
JAM_061_MAX_SQL_THREAD=Nombre maximal de fils par instance de Jaspersoft OLAP utilis\u00e9s pour lancer des requ\u00eates SQL au moment de renseigner les segments
JAM_062_DISABLE_LOCAL_SEGMENT_CACHE=D\u00e9termine si les donn\u00e9es issues des segments sont mises en cache localement.
JAM_063_CELL_BATCH_SIZE=Si > 0, le nombre de cellules qui sont rassembl\u00e9es par lots au moment de construire les segments
JAM_064_ENABLE_IN_MEMORY_ROLLUP=Fonction activ\u00e9e, les donn\u00e9es des segment sont cumul\u00e9es en m\u00e9moire.
JAM_065_FILTER_CHILD_LESS_SNOW_FLAKE_MEMBERS=Fonction activ\u00e9e, certaines requ\u00eates contre des membres de haut niveau de dimensions flocon de neige sont plus ch\u00e8res.
JAM_066_MAX_QUERY_THREADS=Nombre maximal de fils de requ\u00eate MDX par instance de Jaspersoft OLAP
JAM_067_SHEPHERD_THREAD_POLLING_INTERVAL=Intervalle entre les op\u00e9rations de scrutation ex\u00e9cut\u00e9es par le fil de garde RolapConnection
JAM_068_SCHEMA_REFRESH_INTERVAL=Intervalle entre les rafra\u00eechissements de la liste des catalogues XML/A
JAM_069_STATISTICS_PROVIDER=Liste s\u00e9par\u00e9e par des virgules des classes \u00e0 utiliser pour g\u00e9n\u00e9rer des statistiques sur le nombre de lignes dans un tableau
JAM_070_ENABLE_DRILL_THROUGH=Fonction d\u00e9sactiv\u00e9e, Jaspersoft OLAP renvoie une exception lorsque les utilisateurs effectuent un zoom transversal.

JAM_071_MAX_FILTER_COUNT=Nombre maximum de valeurs de filtre d\u2019une vue \u00e0 la demade bas\u00e9e sur OLAP
JAM_072_READ_AGGREGATE_TABLES=Lire les tables d\u2019agr\u00e9gats




