#
# Copyright (C) 2005-2023. Cloud Software Group, Inc. All Rights Reserved.
# http://www.jaspersoft.com.
#
# Unless you have purchased a commercial license agreement from Jaspersoft,
# the following license terms apply:
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the
# License, or (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.
#

ji.export.help.header=Uso: {0} [OPTIONS]\n\nOp\u00E7\u00F5es:\n

ji.export.arg.description.help=Imprimir essa ajuda.

ji.export.arg.description.output-dir=Caminho para um diret\u00F3rio no qual a pasta de cat\u00E1logo de sa\u00EDda ser\u00E1 criada.
ji.export.arg.description.input-dir=Caminho para a importa\u00E7\u00E3o de um cat\u00E1logo a partir de um diret\u00F3rio.

ji.export.arg.description.output-zip=Caminho e nome do arquivo zip de cat\u00E1logo de sa\u00EDda a ser criado\n(omitir caminho para colocar zip no diret\u00F3rio atual)
ji.export.arg.description.input-zip=Caminho e nome do arquivo para importa\u00E7\u00E3o de um cat\u00E1logo a partir de um arquivo zip\n(omitir caminho se zip estiver no diret\u00F3rio atual).
ji.export.arg.description.update-core-user=Quando utilizado sem a op\u00E7\u00E3o --atualizar, os usu\u00E1rios do n\u00FAcleo do cat\u00E1logo n\u00E3o ser\u00E3o \natualizados. Use esta op\u00E7\u00E3o para substituir usu\u00E1rios do n\u00FAcleo\n atualmente definidos.
ji.export.arg.description.skip-user-update=Quando utilizado com a op\u00E7\u00E3o --atualizar, os usu\u00E1rios do cat\u00E1logo n\u00E3o ser\u00E3o\nimportados. Use esta op\u00E7\u00E3o para importar cat\u00E1logos sem substituir\nusu\u00E1rios atualmente definidos.

ji.export.arg.description.update=Recursos no cat\u00E1logo substituir\u00E3o os do reposit\u00F3rio se\nURIs e tipos de corresponderem.

ji.export.arg.description.everything=Exportar tudo, exceto eventos de acesso: todos os recursos do reposit\u00F3rio,\npermiss\u00F5es, trabalhos de relat\u00F3rio, usu\u00E1rios e fun\u00E7\u00F5es.

ji.export.arg.description.uris=URIs do reposit\u00F3rio de recursos ou pastas a serem exportados.
ji.export.arg.description.repository-permissions=Quando utilizado com a op\u00E7\u00E3o --uris, permiss\u00F5es do reposit\u00F3rio ser\u00E3o\nexportadas junto com cada pasta e recurso.
 
ji.export.arg.description.roles=Lista de fun\u00E7\u00F5es a serem exportadas separadas por v\u00EDrgula; se nenhuma fun\u00E7\u00E3o for especificada com esta op\u00E7\u00E3o, todas as fun\u00E7\u00F5es ser\u00E3o exportadas.
ji.export.arg.description.users=Lista de usu\u00E1rios a serem exportados, separados por v\u00EDrgula; se nenhum usu\u00E1rio estiver\nespecificado com esta op\u00E7\u00E3o, todos os usu\u00E1rios ser\u00E3o exportados.
ji.export.arg.description.role-users=Quando utilizado com a op\u00E7\u00E3o --fun\u00E7\u00F5es, os usu\u00E1rios pertencentes a cada fun\u00E7\u00E3o ser\u00E3o exportados.
ji.export.arg.description.users-roles=Quando utilizado com a op\u00E7\u00E3o --usu\u00E1rios, as fun\u00E7\u00F5es pertencentes a cada usu\u00E1rio ser\u00E3o exportadas.

ji.export.arg.description.report-jobs=Lista separada por v\u00EDrgula de unidades de relat\u00F3rio ou URIs de pasta \npara as quais os trabalhos agendados devem ser exportados.

ji.export.arg.description.prepend-path=String a ser prefixada a um caminho URI para todos os recursos importados.

ji.export.arg.description.pass=Senha a ser codificada.

ji.export.encryption.enc-pass=\n\nCriptografando senha:{0}\n
ji.export.encryption.add-string=Adicione a seguinte string a js.jdbc.properties:

ji.export.arg.description.include-access-events=Inclua eventos de acesso ao importar ou exportar.

ji.export.arg.description.include-audit-events=Inclua dados de auditoria ao importar ou exportar.

ji.export.arg.description.include-monitoring-events=Inclua dados de monitoramente ao importar ou exportar.

ji.export.arg.description.include-server-settings=Inclua configura\u00E7\u00F5es do servidor.
ji.export.arg.description.include-attributes=Inclua atributos.
ji.export.arg.description.skip-attribute-values=Ignora valores de atributo.
ji.export.arg.description.resource-types=Lista separada por v\u00EDrgula de tipos de recursos a exportar. Todos os tipos dispon\u00EDveis: {0}.
ji.export.arg.description.skip-dependent-resources=Ignora recursos dependentes.
ji.export.broken-dependencies=Os seguintes recursos t\u00EAm depend\u00EAncias quebradas. Eles fazem refer\u00EAncia a outros recursos que n\u00E3o podem ser acessados.

ji.export.arg.description.broken-dependencies=Define a a\u00E7\u00E3o a ser tomada com depend\u00EAncias quebradas: fail, skip ou include. O valor padr\u00E3o \u00E9 falha.\n fail - O servidor cancelar\u00E1 a importa\u00E7\u00E3o e retornar\u00E1 um erro.\n skip - A importa\u00E7\u00E3o continuar\u00E1, mas os recursos com depend\u00EAncias quebradas n\u00E3o ser\u00E3o importados.\n include - A importa\u00E7\u00E3o continuar\u00E1 e os recursos com depend\u00EAncias quebradas ser\u00E3o importados.

import.broken.dependencies=O arquivo de importa\u00E7\u00E3o cont\u00E9m recursos com depend\u00EAncias quebradas.
import.broken.dependencies.options=Insira 'c' para CANCELAR a importa\u00E7\u00E3o, 's' para concluir a importa\u00E7\u00E3o e IGNORAR os recursos com depend\u00EAncias quebradas ou 'i' para continuar a importa\u00E7\u00E3o e INCLUIR os recursos com depend\u00EAncias quebradas. O padr\u00E3o \u00E9 'c'.

ji.export.organization.unsupported.operation=O recurso com URI de reposit\u00F3rio {0} \u00E9 uma organiza\u00E7\u00E3o.\nJasperReports Server n\u00E3o suporta exporta\u00E7\u00E3o de organiza\u00E7\u00F5es individuais.

ji.export.arg.description.input-key=para especificar a chave secreta da cifra de importa\u00E7\u00E3o-exporta\u00E7\u00E3o
ji.export.arg.description.keyalias=para especificar o alias da chave no keystore
ji.export.arg.description.keypass=para especificar a senha para acessar a chave no keystore
ji.export.arg.description.keyalg=para especificar o algoritmo de criptografia
ji.export.arg.description.keysize=para especificar o tamanho da chave
ji.export.arg.description.keystore=para importar a chave de um keystore java
ji.export.arg.description.secret-key=para especificar os bytes da chave secreta em hexadecimal.
ji.export.arg.description.storepass=para especificar uma senha para o keystore
ji.export.arg.description.genkey=para gerar aleatoriamente a nova chave para criptografar os dados
ji.export.arg.description.secretUri=para especificar o local do reposit\u00F3rio secreto de arquivos
ji.export.arg.description.destkeystore=para especificar o keystore de destino para exporta\u00E7\u00E3o
ji.export.arg.description.deststorepass=para especificar a senha do armazenamento de destino para exporta\u00E7\u00E3o
ji.export.arg.description.destkeypass=para especificar a senha da chave de destino para o alias da chave de entrada
ji.export.arg.description.visible=para especificar a visibilidade da chave na interface do usu\u00E1rio
ji.export.arg.description.keylabel=para especificar o r\u00F3tulo da chave a ser usada pela interface do usu\u00E1rio
ji.export.arg.description.keyorganisation=para especificar o ID da organiza\u00E7\u00E3o para o qual essa chave pertence
ji.export.arg.description.calendars=para especificar calend\u00E1rios de todos os tipos (feriado, recorrente, ...) definidos no planejador
ji.export.arg.description.skip-favorite-resources=Ignorar recursos favoritos.